###################################################################

# Created by write_sdc on Fri Jun 19 23:36:07 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max ss0p72v125c -max_library                         \
N16ADFP_StdCellss0p72v125c\
                         -min ff0p88vm40c -min_library                         \
N16ADFP_StdCellff0p88vm40c
set_wire_load_model -name ZeroWireload -library N16ADFP_StdCellss0p72v125c
set_max_area 0
set_load -pin_load 0.05 [get_ports GON_opsum_issue_fire]
set_load -pin_load 0.05 [get_ports GLB_ifmap_ready]
set_load -pin_load 0.05 [get_ports GLB_filter_ready]
set_load -pin_load 0.05 [get_ports GLB_ipsum_ready]
set_load -pin_load 0.05 [get_ports GLB_opsum_valid]
set_load -pin_load 0.05 [get_ports {GLB_data_out[31]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[30]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[29]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[28]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[27]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[26]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[25]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[24]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[23]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[22]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[21]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[20]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[19]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[18]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[17]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[16]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[15]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[14]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[13]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[12]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[11]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[10]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[9]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[8]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[7]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[6]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[5]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[4]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[3]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[2]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[1]}]
set_load -pin_load 0.05 [get_ports {GLB_data_out[0]}]
set_max_capacitance 0.1 [get_ports clk]
set_max_capacitance 0.1 [get_ports rst]
set_max_capacitance 0.1 [get_ports set_XID]
set_max_capacitance 0.1 [get_ports {ifmap_XID_scan_in[3]}]
set_max_capacitance 0.1 [get_ports {ifmap_XID_scan_in[2]}]
set_max_capacitance 0.1 [get_ports {ifmap_XID_scan_in[1]}]
set_max_capacitance 0.1 [get_ports {ifmap_XID_scan_in[0]}]
set_max_capacitance 0.1 [get_ports {filter_XID_scan_in[3]}]
set_max_capacitance 0.1 [get_ports {filter_XID_scan_in[2]}]
set_max_capacitance 0.1 [get_ports {filter_XID_scan_in[1]}]
set_max_capacitance 0.1 [get_ports {filter_XID_scan_in[0]}]
set_max_capacitance 0.1 [get_ports {ipsum_XID_scan_in[3]}]
set_max_capacitance 0.1 [get_ports {ipsum_XID_scan_in[2]}]
set_max_capacitance 0.1 [get_ports {ipsum_XID_scan_in[1]}]
set_max_capacitance 0.1 [get_ports {ipsum_XID_scan_in[0]}]
set_max_capacitance 0.1 [get_ports {opsum_XID_scan_in[3]}]
set_max_capacitance 0.1 [get_ports {opsum_XID_scan_in[2]}]
set_max_capacitance 0.1 [get_ports {opsum_XID_scan_in[1]}]
set_max_capacitance 0.1 [get_ports {opsum_XID_scan_in[0]}]
set_max_capacitance 0.1 [get_ports set_YID]
set_max_capacitance 0.1 [get_ports {ifmap_YID_scan_in[2]}]
set_max_capacitance 0.1 [get_ports {ifmap_YID_scan_in[1]}]
set_max_capacitance 0.1 [get_ports {ifmap_YID_scan_in[0]}]
set_max_capacitance 0.1 [get_ports {filter_YID_scan_in[2]}]
set_max_capacitance 0.1 [get_ports {filter_YID_scan_in[1]}]
set_max_capacitance 0.1 [get_ports {filter_YID_scan_in[0]}]
set_max_capacitance 0.1 [get_ports {ipsum_YID_scan_in[2]}]
set_max_capacitance 0.1 [get_ports {ipsum_YID_scan_in[1]}]
set_max_capacitance 0.1 [get_ports {ipsum_YID_scan_in[0]}]
set_max_capacitance 0.1 [get_ports {opsum_YID_scan_in[2]}]
set_max_capacitance 0.1 [get_ports {opsum_YID_scan_in[1]}]
set_max_capacitance 0.1 [get_ports {opsum_YID_scan_in[0]}]
set_max_capacitance 0.1 [get_ports set_LN]
set_max_capacitance 0.1 [get_ports {LN_config_in[4]}]
set_max_capacitance 0.1 [get_ports {LN_config_in[3]}]
set_max_capacitance 0.1 [get_ports {LN_config_in[2]}]
set_max_capacitance 0.1 [get_ports {LN_config_in[1]}]
set_max_capacitance 0.1 [get_ports {LN_config_in[0]}]
set_max_capacitance 0.1 [get_ports {PE_en[47]}]
set_max_capacitance 0.1 [get_ports {PE_en[46]}]
set_max_capacitance 0.1 [get_ports {PE_en[45]}]
set_max_capacitance 0.1 [get_ports {PE_en[44]}]
set_max_capacitance 0.1 [get_ports {PE_en[43]}]
set_max_capacitance 0.1 [get_ports {PE_en[42]}]
set_max_capacitance 0.1 [get_ports {PE_en[41]}]
set_max_capacitance 0.1 [get_ports {PE_en[40]}]
set_max_capacitance 0.1 [get_ports {PE_en[39]}]
set_max_capacitance 0.1 [get_ports {PE_en[38]}]
set_max_capacitance 0.1 [get_ports {PE_en[37]}]
set_max_capacitance 0.1 [get_ports {PE_en[36]}]
set_max_capacitance 0.1 [get_ports {PE_en[35]}]
set_max_capacitance 0.1 [get_ports {PE_en[34]}]
set_max_capacitance 0.1 [get_ports {PE_en[33]}]
set_max_capacitance 0.1 [get_ports {PE_en[32]}]
set_max_capacitance 0.1 [get_ports {PE_en[31]}]
set_max_capacitance 0.1 [get_ports {PE_en[30]}]
set_max_capacitance 0.1 [get_ports {PE_en[29]}]
set_max_capacitance 0.1 [get_ports {PE_en[28]}]
set_max_capacitance 0.1 [get_ports {PE_en[27]}]
set_max_capacitance 0.1 [get_ports {PE_en[26]}]
set_max_capacitance 0.1 [get_ports {PE_en[25]}]
set_max_capacitance 0.1 [get_ports {PE_en[24]}]
set_max_capacitance 0.1 [get_ports {PE_en[23]}]
set_max_capacitance 0.1 [get_ports {PE_en[22]}]
set_max_capacitance 0.1 [get_ports {PE_en[21]}]
set_max_capacitance 0.1 [get_ports {PE_en[20]}]
set_max_capacitance 0.1 [get_ports {PE_en[19]}]
set_max_capacitance 0.1 [get_ports {PE_en[18]}]
set_max_capacitance 0.1 [get_ports {PE_en[17]}]
set_max_capacitance 0.1 [get_ports {PE_en[16]}]
set_max_capacitance 0.1 [get_ports {PE_en[15]}]
set_max_capacitance 0.1 [get_ports {PE_en[14]}]
set_max_capacitance 0.1 [get_ports {PE_en[13]}]
set_max_capacitance 0.1 [get_ports {PE_en[12]}]
set_max_capacitance 0.1 [get_ports {PE_en[11]}]
set_max_capacitance 0.1 [get_ports {PE_en[10]}]
set_max_capacitance 0.1 [get_ports {PE_en[9]}]
set_max_capacitance 0.1 [get_ports {PE_en[8]}]
set_max_capacitance 0.1 [get_ports {PE_en[7]}]
set_max_capacitance 0.1 [get_ports {PE_en[6]}]
set_max_capacitance 0.1 [get_ports {PE_en[5]}]
set_max_capacitance 0.1 [get_ports {PE_en[4]}]
set_max_capacitance 0.1 [get_ports {PE_en[3]}]
set_max_capacitance 0.1 [get_ports {PE_en[2]}]
set_max_capacitance 0.1 [get_ports {PE_en[1]}]
set_max_capacitance 0.1 [get_ports {PE_en[0]}]
set_max_capacitance 0.1 [get_ports {PE_config[9]}]
set_max_capacitance 0.1 [get_ports {PE_config[8]}]
set_max_capacitance 0.1 [get_ports {PE_config[7]}]
set_max_capacitance 0.1 [get_ports {PE_config[6]}]
set_max_capacitance 0.1 [get_ports {PE_config[5]}]
set_max_capacitance 0.1 [get_ports {PE_config[4]}]
set_max_capacitance 0.1 [get_ports {PE_config[3]}]
set_max_capacitance 0.1 [get_ports {PE_config[2]}]
set_max_capacitance 0.1 [get_ports {PE_config[1]}]
set_max_capacitance 0.1 [get_ports {PE_config[0]}]
set_max_capacitance 0.1 [get_ports {ifmap_tag_X[3]}]
set_max_capacitance 0.1 [get_ports {ifmap_tag_X[2]}]
set_max_capacitance 0.1 [get_ports {ifmap_tag_X[1]}]
set_max_capacitance 0.1 [get_ports {ifmap_tag_X[0]}]
set_max_capacitance 0.1 [get_ports {ifmap_tag_Y[2]}]
set_max_capacitance 0.1 [get_ports {ifmap_tag_Y[1]}]
set_max_capacitance 0.1 [get_ports {ifmap_tag_Y[0]}]
set_max_capacitance 0.1 [get_ports {filter_tag_X[3]}]
set_max_capacitance 0.1 [get_ports {filter_tag_X[2]}]
set_max_capacitance 0.1 [get_ports {filter_tag_X[1]}]
set_max_capacitance 0.1 [get_ports {filter_tag_X[0]}]
set_max_capacitance 0.1 [get_ports {filter_tag_Y[2]}]
set_max_capacitance 0.1 [get_ports {filter_tag_Y[1]}]
set_max_capacitance 0.1 [get_ports {filter_tag_Y[0]}]
set_max_capacitance 0.1 [get_ports {ipsum_tag_X[3]}]
set_max_capacitance 0.1 [get_ports {ipsum_tag_X[2]}]
set_max_capacitance 0.1 [get_ports {ipsum_tag_X[1]}]
set_max_capacitance 0.1 [get_ports {ipsum_tag_X[0]}]
set_max_capacitance 0.1 [get_ports {ipsum_tag_Y[2]}]
set_max_capacitance 0.1 [get_ports {ipsum_tag_Y[1]}]
set_max_capacitance 0.1 [get_ports {ipsum_tag_Y[0]}]
set_max_capacitance 0.1 [get_ports {opsum_tag_X[3]}]
set_max_capacitance 0.1 [get_ports {opsum_tag_X[2]}]
set_max_capacitance 0.1 [get_ports {opsum_tag_X[1]}]
set_max_capacitance 0.1 [get_ports {opsum_tag_X[0]}]
set_max_capacitance 0.1 [get_ports {opsum_tag_Y[2]}]
set_max_capacitance 0.1 [get_ports {opsum_tag_Y[1]}]
set_max_capacitance 0.1 [get_ports {opsum_tag_Y[0]}]
set_max_capacitance 0.1 [get_ports {opsum_next_tag_X[3]}]
set_max_capacitance 0.1 [get_ports {opsum_next_tag_X[2]}]
set_max_capacitance 0.1 [get_ports {opsum_next_tag_X[1]}]
set_max_capacitance 0.1 [get_ports {opsum_next_tag_X[0]}]
set_max_capacitance 0.1 [get_ports {opsum_next_tag_Y[2]}]
set_max_capacitance 0.1 [get_ports {opsum_next_tag_Y[1]}]
set_max_capacitance 0.1 [get_ports {opsum_next_tag_Y[0]}]
set_max_capacitance 0.1 [get_ports opsum_next_tag_valid]
set_max_capacitance 0.1 [get_ports GON_opsum_issue_valid]
set_max_capacitance 0.1 [get_ports GON_opsum_issue_ready]
set_max_capacitance 0.1 [get_ports GLB_ifmap_valid]
set_max_capacitance 0.1 [get_ports GLB_filter_valid]
set_max_capacitance 0.1 [get_ports GLB_ipsum_valid]
set_max_capacitance 0.1 [get_ports {GLB_data_in[31]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[30]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[29]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[28]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[27]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[26]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[25]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[24]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[23]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[22]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[21]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[20]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[19]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[18]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[17]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[16]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[15]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[14]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[13]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[12]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[11]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[10]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[9]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[8]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[7]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[6]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[5]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[4]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[3]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[2]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[1]}]
set_max_capacitance 0.1 [get_ports {GLB_data_in[0]}]
set_max_capacitance 0.1 [get_ports GLB_opsum_ready]
set_max_fanout 10 [get_ports clk]
set_max_fanout 10 [get_ports rst]
set_max_fanout 10 [get_ports set_XID]
set_max_fanout 10 [get_ports {ifmap_XID_scan_in[3]}]
set_max_fanout 10 [get_ports {ifmap_XID_scan_in[2]}]
set_max_fanout 10 [get_ports {ifmap_XID_scan_in[1]}]
set_max_fanout 10 [get_ports {ifmap_XID_scan_in[0]}]
set_max_fanout 10 [get_ports {filter_XID_scan_in[3]}]
set_max_fanout 10 [get_ports {filter_XID_scan_in[2]}]
set_max_fanout 10 [get_ports {filter_XID_scan_in[1]}]
set_max_fanout 10 [get_ports {filter_XID_scan_in[0]}]
set_max_fanout 10 [get_ports {ipsum_XID_scan_in[3]}]
set_max_fanout 10 [get_ports {ipsum_XID_scan_in[2]}]
set_max_fanout 10 [get_ports {ipsum_XID_scan_in[1]}]
set_max_fanout 10 [get_ports {ipsum_XID_scan_in[0]}]
set_max_fanout 10 [get_ports {opsum_XID_scan_in[3]}]
set_max_fanout 10 [get_ports {opsum_XID_scan_in[2]}]
set_max_fanout 10 [get_ports {opsum_XID_scan_in[1]}]
set_max_fanout 10 [get_ports {opsum_XID_scan_in[0]}]
set_max_fanout 10 [get_ports set_YID]
set_max_fanout 10 [get_ports {ifmap_YID_scan_in[2]}]
set_max_fanout 10 [get_ports {ifmap_YID_scan_in[1]}]
set_max_fanout 10 [get_ports {ifmap_YID_scan_in[0]}]
set_max_fanout 10 [get_ports {filter_YID_scan_in[2]}]
set_max_fanout 10 [get_ports {filter_YID_scan_in[1]}]
set_max_fanout 10 [get_ports {filter_YID_scan_in[0]}]
set_max_fanout 10 [get_ports {ipsum_YID_scan_in[2]}]
set_max_fanout 10 [get_ports {ipsum_YID_scan_in[1]}]
set_max_fanout 10 [get_ports {ipsum_YID_scan_in[0]}]
set_max_fanout 10 [get_ports {opsum_YID_scan_in[2]}]
set_max_fanout 10 [get_ports {opsum_YID_scan_in[1]}]
set_max_fanout 10 [get_ports {opsum_YID_scan_in[0]}]
set_max_fanout 10 [get_ports set_LN]
set_max_fanout 10 [get_ports {LN_config_in[4]}]
set_max_fanout 10 [get_ports {LN_config_in[3]}]
set_max_fanout 10 [get_ports {LN_config_in[2]}]
set_max_fanout 10 [get_ports {LN_config_in[1]}]
set_max_fanout 10 [get_ports {LN_config_in[0]}]
set_max_fanout 10 [get_ports {PE_en[47]}]
set_max_fanout 10 [get_ports {PE_en[46]}]
set_max_fanout 10 [get_ports {PE_en[45]}]
set_max_fanout 10 [get_ports {PE_en[44]}]
set_max_fanout 10 [get_ports {PE_en[43]}]
set_max_fanout 10 [get_ports {PE_en[42]}]
set_max_fanout 10 [get_ports {PE_en[41]}]
set_max_fanout 10 [get_ports {PE_en[40]}]
set_max_fanout 10 [get_ports {PE_en[39]}]
set_max_fanout 10 [get_ports {PE_en[38]}]
set_max_fanout 10 [get_ports {PE_en[37]}]
set_max_fanout 10 [get_ports {PE_en[36]}]
set_max_fanout 10 [get_ports {PE_en[35]}]
set_max_fanout 10 [get_ports {PE_en[34]}]
set_max_fanout 10 [get_ports {PE_en[33]}]
set_max_fanout 10 [get_ports {PE_en[32]}]
set_max_fanout 10 [get_ports {PE_en[31]}]
set_max_fanout 10 [get_ports {PE_en[30]}]
set_max_fanout 10 [get_ports {PE_en[29]}]
set_max_fanout 10 [get_ports {PE_en[28]}]
set_max_fanout 10 [get_ports {PE_en[27]}]
set_max_fanout 10 [get_ports {PE_en[26]}]
set_max_fanout 10 [get_ports {PE_en[25]}]
set_max_fanout 10 [get_ports {PE_en[24]}]
set_max_fanout 10 [get_ports {PE_en[23]}]
set_max_fanout 10 [get_ports {PE_en[22]}]
set_max_fanout 10 [get_ports {PE_en[21]}]
set_max_fanout 10 [get_ports {PE_en[20]}]
set_max_fanout 10 [get_ports {PE_en[19]}]
set_max_fanout 10 [get_ports {PE_en[18]}]
set_max_fanout 10 [get_ports {PE_en[17]}]
set_max_fanout 10 [get_ports {PE_en[16]}]
set_max_fanout 10 [get_ports {PE_en[15]}]
set_max_fanout 10 [get_ports {PE_en[14]}]
set_max_fanout 10 [get_ports {PE_en[13]}]
set_max_fanout 10 [get_ports {PE_en[12]}]
set_max_fanout 10 [get_ports {PE_en[11]}]
set_max_fanout 10 [get_ports {PE_en[10]}]
set_max_fanout 10 [get_ports {PE_en[9]}]
set_max_fanout 10 [get_ports {PE_en[8]}]
set_max_fanout 10 [get_ports {PE_en[7]}]
set_max_fanout 10 [get_ports {PE_en[6]}]
set_max_fanout 10 [get_ports {PE_en[5]}]
set_max_fanout 10 [get_ports {PE_en[4]}]
set_max_fanout 10 [get_ports {PE_en[3]}]
set_max_fanout 10 [get_ports {PE_en[2]}]
set_max_fanout 10 [get_ports {PE_en[1]}]
set_max_fanout 10 [get_ports {PE_en[0]}]
set_max_fanout 10 [get_ports {PE_config[9]}]
set_max_fanout 10 [get_ports {PE_config[8]}]
set_max_fanout 10 [get_ports {PE_config[7]}]
set_max_fanout 10 [get_ports {PE_config[6]}]
set_max_fanout 10 [get_ports {PE_config[5]}]
set_max_fanout 10 [get_ports {PE_config[4]}]
set_max_fanout 10 [get_ports {PE_config[3]}]
set_max_fanout 10 [get_ports {PE_config[2]}]
set_max_fanout 10 [get_ports {PE_config[1]}]
set_max_fanout 10 [get_ports {PE_config[0]}]
set_max_fanout 10 [get_ports {ifmap_tag_X[3]}]
set_max_fanout 10 [get_ports {ifmap_tag_X[2]}]
set_max_fanout 10 [get_ports {ifmap_tag_X[1]}]
set_max_fanout 10 [get_ports {ifmap_tag_X[0]}]
set_max_fanout 10 [get_ports {ifmap_tag_Y[2]}]
set_max_fanout 10 [get_ports {ifmap_tag_Y[1]}]
set_max_fanout 10 [get_ports {ifmap_tag_Y[0]}]
set_max_fanout 10 [get_ports {filter_tag_X[3]}]
set_max_fanout 10 [get_ports {filter_tag_X[2]}]
set_max_fanout 10 [get_ports {filter_tag_X[1]}]
set_max_fanout 10 [get_ports {filter_tag_X[0]}]
set_max_fanout 10 [get_ports {filter_tag_Y[2]}]
set_max_fanout 10 [get_ports {filter_tag_Y[1]}]
set_max_fanout 10 [get_ports {filter_tag_Y[0]}]
set_max_fanout 10 [get_ports {ipsum_tag_X[3]}]
set_max_fanout 10 [get_ports {ipsum_tag_X[2]}]
set_max_fanout 10 [get_ports {ipsum_tag_X[1]}]
set_max_fanout 10 [get_ports {ipsum_tag_X[0]}]
set_max_fanout 10 [get_ports {ipsum_tag_Y[2]}]
set_max_fanout 10 [get_ports {ipsum_tag_Y[1]}]
set_max_fanout 10 [get_ports {ipsum_tag_Y[0]}]
set_max_fanout 10 [get_ports {opsum_tag_X[3]}]
set_max_fanout 10 [get_ports {opsum_tag_X[2]}]
set_max_fanout 10 [get_ports {opsum_tag_X[1]}]
set_max_fanout 10 [get_ports {opsum_tag_X[0]}]
set_max_fanout 10 [get_ports {opsum_tag_Y[2]}]
set_max_fanout 10 [get_ports {opsum_tag_Y[1]}]
set_max_fanout 10 [get_ports {opsum_tag_Y[0]}]
set_max_fanout 10 [get_ports {opsum_next_tag_X[3]}]
set_max_fanout 10 [get_ports {opsum_next_tag_X[2]}]
set_max_fanout 10 [get_ports {opsum_next_tag_X[1]}]
set_max_fanout 10 [get_ports {opsum_next_tag_X[0]}]
set_max_fanout 10 [get_ports {opsum_next_tag_Y[2]}]
set_max_fanout 10 [get_ports {opsum_next_tag_Y[1]}]
set_max_fanout 10 [get_ports {opsum_next_tag_Y[0]}]
set_max_fanout 10 [get_ports opsum_next_tag_valid]
set_max_fanout 10 [get_ports GON_opsum_issue_valid]
set_max_fanout 10 [get_ports GON_opsum_issue_ready]
set_max_fanout 10 [get_ports GLB_ifmap_valid]
set_max_fanout 10 [get_ports GLB_filter_valid]
set_max_fanout 10 [get_ports GLB_ipsum_valid]
set_max_fanout 10 [get_ports {GLB_data_in[31]}]
set_max_fanout 10 [get_ports {GLB_data_in[30]}]
set_max_fanout 10 [get_ports {GLB_data_in[29]}]
set_max_fanout 10 [get_ports {GLB_data_in[28]}]
set_max_fanout 10 [get_ports {GLB_data_in[27]}]
set_max_fanout 10 [get_ports {GLB_data_in[26]}]
set_max_fanout 10 [get_ports {GLB_data_in[25]}]
set_max_fanout 10 [get_ports {GLB_data_in[24]}]
set_max_fanout 10 [get_ports {GLB_data_in[23]}]
set_max_fanout 10 [get_ports {GLB_data_in[22]}]
set_max_fanout 10 [get_ports {GLB_data_in[21]}]
set_max_fanout 10 [get_ports {GLB_data_in[20]}]
set_max_fanout 10 [get_ports {GLB_data_in[19]}]
set_max_fanout 10 [get_ports {GLB_data_in[18]}]
set_max_fanout 10 [get_ports {GLB_data_in[17]}]
set_max_fanout 10 [get_ports {GLB_data_in[16]}]
set_max_fanout 10 [get_ports {GLB_data_in[15]}]
set_max_fanout 10 [get_ports {GLB_data_in[14]}]
set_max_fanout 10 [get_ports {GLB_data_in[13]}]
set_max_fanout 10 [get_ports {GLB_data_in[12]}]
set_max_fanout 10 [get_ports {GLB_data_in[11]}]
set_max_fanout 10 [get_ports {GLB_data_in[10]}]
set_max_fanout 10 [get_ports {GLB_data_in[9]}]
set_max_fanout 10 [get_ports {GLB_data_in[8]}]
set_max_fanout 10 [get_ports {GLB_data_in[7]}]
set_max_fanout 10 [get_ports {GLB_data_in[6]}]
set_max_fanout 10 [get_ports {GLB_data_in[5]}]
set_max_fanout 10 [get_ports {GLB_data_in[4]}]
set_max_fanout 10 [get_ports {GLB_data_in[3]}]
set_max_fanout 10 [get_ports {GLB_data_in[2]}]
set_max_fanout 10 [get_ports {GLB_data_in[1]}]
set_max_fanout 10 [get_ports {GLB_data_in[0]}]
set_max_fanout 10 [get_ports GLB_opsum_ready]
set_max_transition 0.5 [get_ports clk]
set_max_transition 0.5 [get_ports rst]
set_max_transition 0.5 [get_ports set_XID]
set_max_transition 0.5 [get_ports {ifmap_XID_scan_in[3]}]
set_max_transition 0.5 [get_ports {ifmap_XID_scan_in[2]}]
set_max_transition 0.5 [get_ports {ifmap_XID_scan_in[1]}]
set_max_transition 0.5 [get_ports {ifmap_XID_scan_in[0]}]
set_max_transition 0.5 [get_ports {filter_XID_scan_in[3]}]
set_max_transition 0.5 [get_ports {filter_XID_scan_in[2]}]
set_max_transition 0.5 [get_ports {filter_XID_scan_in[1]}]
set_max_transition 0.5 [get_ports {filter_XID_scan_in[0]}]
set_max_transition 0.5 [get_ports {ipsum_XID_scan_in[3]}]
set_max_transition 0.5 [get_ports {ipsum_XID_scan_in[2]}]
set_max_transition 0.5 [get_ports {ipsum_XID_scan_in[1]}]
set_max_transition 0.5 [get_ports {ipsum_XID_scan_in[0]}]
set_max_transition 0.5 [get_ports {opsum_XID_scan_in[3]}]
set_max_transition 0.5 [get_ports {opsum_XID_scan_in[2]}]
set_max_transition 0.5 [get_ports {opsum_XID_scan_in[1]}]
set_max_transition 0.5 [get_ports {opsum_XID_scan_in[0]}]
set_max_transition 0.5 [get_ports set_YID]
set_max_transition 0.5 [get_ports {ifmap_YID_scan_in[2]}]
set_max_transition 0.5 [get_ports {ifmap_YID_scan_in[1]}]
set_max_transition 0.5 [get_ports {ifmap_YID_scan_in[0]}]
set_max_transition 0.5 [get_ports {filter_YID_scan_in[2]}]
set_max_transition 0.5 [get_ports {filter_YID_scan_in[1]}]
set_max_transition 0.5 [get_ports {filter_YID_scan_in[0]}]
set_max_transition 0.5 [get_ports {ipsum_YID_scan_in[2]}]
set_max_transition 0.5 [get_ports {ipsum_YID_scan_in[1]}]
set_max_transition 0.5 [get_ports {ipsum_YID_scan_in[0]}]
set_max_transition 0.5 [get_ports {opsum_YID_scan_in[2]}]
set_max_transition 0.5 [get_ports {opsum_YID_scan_in[1]}]
set_max_transition 0.5 [get_ports {opsum_YID_scan_in[0]}]
set_max_transition 0.5 [get_ports set_LN]
set_max_transition 0.5 [get_ports {LN_config_in[4]}]
set_max_transition 0.5 [get_ports {LN_config_in[3]}]
set_max_transition 0.5 [get_ports {LN_config_in[2]}]
set_max_transition 0.5 [get_ports {LN_config_in[1]}]
set_max_transition 0.5 [get_ports {LN_config_in[0]}]
set_max_transition 0.5 [get_ports {PE_en[47]}]
set_max_transition 0.5 [get_ports {PE_en[46]}]
set_max_transition 0.5 [get_ports {PE_en[45]}]
set_max_transition 0.5 [get_ports {PE_en[44]}]
set_max_transition 0.5 [get_ports {PE_en[43]}]
set_max_transition 0.5 [get_ports {PE_en[42]}]
set_max_transition 0.5 [get_ports {PE_en[41]}]
set_max_transition 0.5 [get_ports {PE_en[40]}]
set_max_transition 0.5 [get_ports {PE_en[39]}]
set_max_transition 0.5 [get_ports {PE_en[38]}]
set_max_transition 0.5 [get_ports {PE_en[37]}]
set_max_transition 0.5 [get_ports {PE_en[36]}]
set_max_transition 0.5 [get_ports {PE_en[35]}]
set_max_transition 0.5 [get_ports {PE_en[34]}]
set_max_transition 0.5 [get_ports {PE_en[33]}]
set_max_transition 0.5 [get_ports {PE_en[32]}]
set_max_transition 0.5 [get_ports {PE_en[31]}]
set_max_transition 0.5 [get_ports {PE_en[30]}]
set_max_transition 0.5 [get_ports {PE_en[29]}]
set_max_transition 0.5 [get_ports {PE_en[28]}]
set_max_transition 0.5 [get_ports {PE_en[27]}]
set_max_transition 0.5 [get_ports {PE_en[26]}]
set_max_transition 0.5 [get_ports {PE_en[25]}]
set_max_transition 0.5 [get_ports {PE_en[24]}]
set_max_transition 0.5 [get_ports {PE_en[23]}]
set_max_transition 0.5 [get_ports {PE_en[22]}]
set_max_transition 0.5 [get_ports {PE_en[21]}]
set_max_transition 0.5 [get_ports {PE_en[20]}]
set_max_transition 0.5 [get_ports {PE_en[19]}]
set_max_transition 0.5 [get_ports {PE_en[18]}]
set_max_transition 0.5 [get_ports {PE_en[17]}]
set_max_transition 0.5 [get_ports {PE_en[16]}]
set_max_transition 0.5 [get_ports {PE_en[15]}]
set_max_transition 0.5 [get_ports {PE_en[14]}]
set_max_transition 0.5 [get_ports {PE_en[13]}]
set_max_transition 0.5 [get_ports {PE_en[12]}]
set_max_transition 0.5 [get_ports {PE_en[11]}]
set_max_transition 0.5 [get_ports {PE_en[10]}]
set_max_transition 0.5 [get_ports {PE_en[9]}]
set_max_transition 0.5 [get_ports {PE_en[8]}]
set_max_transition 0.5 [get_ports {PE_en[7]}]
set_max_transition 0.5 [get_ports {PE_en[6]}]
set_max_transition 0.5 [get_ports {PE_en[5]}]
set_max_transition 0.5 [get_ports {PE_en[4]}]
set_max_transition 0.5 [get_ports {PE_en[3]}]
set_max_transition 0.5 [get_ports {PE_en[2]}]
set_max_transition 0.5 [get_ports {PE_en[1]}]
set_max_transition 0.5 [get_ports {PE_en[0]}]
set_max_transition 0.5 [get_ports {PE_config[9]}]
set_max_transition 0.5 [get_ports {PE_config[8]}]
set_max_transition 0.5 [get_ports {PE_config[7]}]
set_max_transition 0.5 [get_ports {PE_config[6]}]
set_max_transition 0.5 [get_ports {PE_config[5]}]
set_max_transition 0.5 [get_ports {PE_config[4]}]
set_max_transition 0.5 [get_ports {PE_config[3]}]
set_max_transition 0.5 [get_ports {PE_config[2]}]
set_max_transition 0.5 [get_ports {PE_config[1]}]
set_max_transition 0.5 [get_ports {PE_config[0]}]
set_max_transition 0.5 [get_ports {ifmap_tag_X[3]}]
set_max_transition 0.5 [get_ports {ifmap_tag_X[2]}]
set_max_transition 0.5 [get_ports {ifmap_tag_X[1]}]
set_max_transition 0.5 [get_ports {ifmap_tag_X[0]}]
set_max_transition 0.5 [get_ports {ifmap_tag_Y[2]}]
set_max_transition 0.5 [get_ports {ifmap_tag_Y[1]}]
set_max_transition 0.5 [get_ports {ifmap_tag_Y[0]}]
set_max_transition 0.5 [get_ports {filter_tag_X[3]}]
set_max_transition 0.5 [get_ports {filter_tag_X[2]}]
set_max_transition 0.5 [get_ports {filter_tag_X[1]}]
set_max_transition 0.5 [get_ports {filter_tag_X[0]}]
set_max_transition 0.5 [get_ports {filter_tag_Y[2]}]
set_max_transition 0.5 [get_ports {filter_tag_Y[1]}]
set_max_transition 0.5 [get_ports {filter_tag_Y[0]}]
set_max_transition 0.5 [get_ports {ipsum_tag_X[3]}]
set_max_transition 0.5 [get_ports {ipsum_tag_X[2]}]
set_max_transition 0.5 [get_ports {ipsum_tag_X[1]}]
set_max_transition 0.5 [get_ports {ipsum_tag_X[0]}]
set_max_transition 0.5 [get_ports {ipsum_tag_Y[2]}]
set_max_transition 0.5 [get_ports {ipsum_tag_Y[1]}]
set_max_transition 0.5 [get_ports {ipsum_tag_Y[0]}]
set_max_transition 0.5 [get_ports {opsum_tag_X[3]}]
set_max_transition 0.5 [get_ports {opsum_tag_X[2]}]
set_max_transition 0.5 [get_ports {opsum_tag_X[1]}]
set_max_transition 0.5 [get_ports {opsum_tag_X[0]}]
set_max_transition 0.5 [get_ports {opsum_tag_Y[2]}]
set_max_transition 0.5 [get_ports {opsum_tag_Y[1]}]
set_max_transition 0.5 [get_ports {opsum_tag_Y[0]}]
set_max_transition 0.5 [get_ports {opsum_next_tag_X[3]}]
set_max_transition 0.5 [get_ports {opsum_next_tag_X[2]}]
set_max_transition 0.5 [get_ports {opsum_next_tag_X[1]}]
set_max_transition 0.5 [get_ports {opsum_next_tag_X[0]}]
set_max_transition 0.5 [get_ports {opsum_next_tag_Y[2]}]
set_max_transition 0.5 [get_ports {opsum_next_tag_Y[1]}]
set_max_transition 0.5 [get_ports {opsum_next_tag_Y[0]}]
set_max_transition 0.5 [get_ports opsum_next_tag_valid]
set_max_transition 0.5 [get_ports GON_opsum_issue_valid]
set_max_transition 0.5 [get_ports GON_opsum_issue_ready]
set_max_transition 0.5 [get_ports GLB_ifmap_valid]
set_max_transition 0.5 [get_ports GLB_filter_valid]
set_max_transition 0.5 [get_ports GLB_ipsum_valid]
set_max_transition 0.5 [get_ports {GLB_data_in[31]}]
set_max_transition 0.5 [get_ports {GLB_data_in[30]}]
set_max_transition 0.5 [get_ports {GLB_data_in[29]}]
set_max_transition 0.5 [get_ports {GLB_data_in[28]}]
set_max_transition 0.5 [get_ports {GLB_data_in[27]}]
set_max_transition 0.5 [get_ports {GLB_data_in[26]}]
set_max_transition 0.5 [get_ports {GLB_data_in[25]}]
set_max_transition 0.5 [get_ports {GLB_data_in[24]}]
set_max_transition 0.5 [get_ports {GLB_data_in[23]}]
set_max_transition 0.5 [get_ports {GLB_data_in[22]}]
set_max_transition 0.5 [get_ports {GLB_data_in[21]}]
set_max_transition 0.5 [get_ports {GLB_data_in[20]}]
set_max_transition 0.5 [get_ports {GLB_data_in[19]}]
set_max_transition 0.5 [get_ports {GLB_data_in[18]}]
set_max_transition 0.5 [get_ports {GLB_data_in[17]}]
set_max_transition 0.5 [get_ports {GLB_data_in[16]}]
set_max_transition 0.5 [get_ports {GLB_data_in[15]}]
set_max_transition 0.5 [get_ports {GLB_data_in[14]}]
set_max_transition 0.5 [get_ports {GLB_data_in[13]}]
set_max_transition 0.5 [get_ports {GLB_data_in[12]}]
set_max_transition 0.5 [get_ports {GLB_data_in[11]}]
set_max_transition 0.5 [get_ports {GLB_data_in[10]}]
set_max_transition 0.5 [get_ports {GLB_data_in[9]}]
set_max_transition 0.5 [get_ports {GLB_data_in[8]}]
set_max_transition 0.5 [get_ports {GLB_data_in[7]}]
set_max_transition 0.5 [get_ports {GLB_data_in[6]}]
set_max_transition 0.5 [get_ports {GLB_data_in[5]}]
set_max_transition 0.5 [get_ports {GLB_data_in[4]}]
set_max_transition 0.5 [get_ports {GLB_data_in[3]}]
set_max_transition 0.5 [get_ports {GLB_data_in[2]}]
set_max_transition 0.5 [get_ports {GLB_data_in[1]}]
set_max_transition 0.5 [get_ports {GLB_data_in[0]}]
set_max_transition 0.5 [get_ports GLB_opsum_ready]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 1.85  -waveform {0 0.925}
set_clock_latency 0.12  [get_clocks clk]
set_clock_latency -source 0.13  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.05 [get_clocks clk]
set_clock_transition -min -fall 0.05 [get_clocks clk]
set_clock_transition -min -rise 0.05 [get_clocks clk]
set_clock_transition -max -fall 0.05 [get_clocks clk]
set_input_delay -clock clk  -max 1.11  [get_ports rst]
set_input_delay -clock clk  -min 0  [get_ports rst]
set_input_delay -clock clk  -max 1.11  [get_ports set_XID]
set_input_delay -clock clk  -min 0  [get_ports set_XID]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_XID_scan_in[3]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_XID_scan_in[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_XID_scan_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_XID_scan_in[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_XID_scan_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_XID_scan_in[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_XID_scan_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_XID_scan_in[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_XID_scan_in[3]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_XID_scan_in[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_XID_scan_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_XID_scan_in[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_XID_scan_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_XID_scan_in[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_XID_scan_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_XID_scan_in[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_XID_scan_in[3]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_XID_scan_in[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_XID_scan_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_XID_scan_in[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_XID_scan_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_XID_scan_in[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_XID_scan_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_XID_scan_in[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_XID_scan_in[3]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_XID_scan_in[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_XID_scan_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_XID_scan_in[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_XID_scan_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_XID_scan_in[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_XID_scan_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_XID_scan_in[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports set_YID]
set_input_delay -clock clk  -min 0  [get_ports set_YID]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_YID_scan_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_YID_scan_in[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_YID_scan_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_YID_scan_in[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_YID_scan_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_YID_scan_in[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_YID_scan_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_YID_scan_in[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_YID_scan_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_YID_scan_in[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_YID_scan_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_YID_scan_in[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_YID_scan_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_YID_scan_in[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_YID_scan_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_YID_scan_in[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_YID_scan_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_YID_scan_in[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_YID_scan_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_YID_scan_in[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_YID_scan_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_YID_scan_in[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_YID_scan_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_YID_scan_in[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports set_LN]
set_input_delay -clock clk  -min 0  [get_ports set_LN]
set_input_delay -clock clk  -max 1.11  [get_ports {LN_config_in[4]}]
set_input_delay -clock clk  -min 0  [get_ports {LN_config_in[4]}]
set_input_delay -clock clk  -max 1.11  [get_ports {LN_config_in[3]}]
set_input_delay -clock clk  -min 0  [get_ports {LN_config_in[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {LN_config_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {LN_config_in[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {LN_config_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {LN_config_in[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {LN_config_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {LN_config_in[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[47]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[47]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[46]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[46]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[45]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[45]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[44]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[44]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[43]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[43]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[42]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[42]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[41]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[41]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[40]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[40]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[39]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[39]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[38]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[38]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[37]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[37]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[36]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[36]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[35]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[35]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[34]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[34]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[33]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[33]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[32]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[32]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[31]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[31]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[30]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[30]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[29]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[29]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[28]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[28]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[27]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[27]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[26]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[26]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[25]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[25]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[24]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[24]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[23]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[23]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[22]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[22]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[21]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[21]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[20]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[20]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[19]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[19]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[18]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[18]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[17]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[17]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[16]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[16]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[15]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[15]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[14]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[14]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[13]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[13]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[12]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[12]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[11]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[11]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[10]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[10]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[9]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[9]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[8]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[8]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[7]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[7]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[6]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[6]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[5]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[5]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[4]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[4]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[3]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[2]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[1]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_en[0]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_en[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_config[9]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_config[9]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_config[8]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_config[8]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_config[7]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_config[7]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_config[6]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_config[6]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_config[5]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_config[5]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_config[4]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_config[4]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_config[3]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_config[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_config[2]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_config[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_config[1]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_config[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {PE_config[0]}]
set_input_delay -clock clk  -min 0  [get_ports {PE_config[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_tag_X[3]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_tag_X[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_tag_X[2]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_tag_X[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_tag_X[1]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_tag_X[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_tag_X[0]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_tag_X[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_tag_Y[2]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_tag_Y[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_tag_Y[1]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_tag_Y[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ifmap_tag_Y[0]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap_tag_Y[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_tag_X[3]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_tag_X[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_tag_X[2]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_tag_X[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_tag_X[1]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_tag_X[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_tag_X[0]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_tag_X[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_tag_Y[2]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_tag_Y[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_tag_Y[1]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_tag_Y[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {filter_tag_Y[0]}]
set_input_delay -clock clk  -min 0  [get_ports {filter_tag_Y[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_tag_X[3]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_tag_X[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_tag_X[2]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_tag_X[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_tag_X[1]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_tag_X[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_tag_X[0]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_tag_X[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_tag_Y[2]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_tag_Y[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_tag_Y[1]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_tag_Y[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {ipsum_tag_Y[0]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum_tag_Y[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_tag_X[3]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_tag_X[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_tag_X[2]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_tag_X[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_tag_X[1]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_tag_X[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_tag_X[0]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_tag_X[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_tag_Y[2]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_tag_Y[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_tag_Y[1]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_tag_Y[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_tag_Y[0]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_tag_Y[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_next_tag_X[3]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_next_tag_X[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_next_tag_X[2]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_next_tag_X[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_next_tag_X[1]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_next_tag_X[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_next_tag_X[0]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_next_tag_X[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_next_tag_Y[2]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_next_tag_Y[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_next_tag_Y[1]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_next_tag_Y[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {opsum_next_tag_Y[0]}]
set_input_delay -clock clk  -min 0  [get_ports {opsum_next_tag_Y[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports opsum_next_tag_valid]
set_input_delay -clock clk  -min 0  [get_ports opsum_next_tag_valid]
set_input_delay -clock clk  -max 1.11  [get_ports GON_opsum_issue_valid]
set_input_delay -clock clk  -min 0  [get_ports GON_opsum_issue_valid]
set_input_delay -clock clk  -max 1.11  [get_ports GON_opsum_issue_ready]
set_input_delay -clock clk  -min 0  [get_ports GON_opsum_issue_ready]
set_input_delay -clock clk  -max 1.11  [get_ports GLB_ifmap_valid]
set_input_delay -clock clk  -min 0  [get_ports GLB_ifmap_valid]
set_input_delay -clock clk  -max 1.11  [get_ports GLB_filter_valid]
set_input_delay -clock clk  -min 0  [get_ports GLB_filter_valid]
set_input_delay -clock clk  -max 1.11  [get_ports GLB_ipsum_valid]
set_input_delay -clock clk  -min 0  [get_ports GLB_ipsum_valid]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[31]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[31]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[30]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[30]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[29]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[29]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[28]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[28]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[27]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[27]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[26]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[26]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[25]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[25]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[24]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[24]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[23]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[23]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[22]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[22]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[21]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[21]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[20]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[20]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[19]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[19]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[18]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[18]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[17]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[17]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[16]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[16]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[15]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[15]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[14]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[14]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[13]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[13]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[12]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[12]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[11]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[11]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[10]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[10]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[9]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[9]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[8]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[8]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[7]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[7]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[6]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[6]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[5]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[5]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[4]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[4]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[3]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[3]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[2]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[2]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[1]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[1]}]
set_input_delay -clock clk  -max 1.11  [get_ports {GLB_data_in[0]}]
set_input_delay -clock clk  -min 0  [get_ports {GLB_data_in[0]}]
set_input_delay -clock clk  -max 1.11  [get_ports GLB_opsum_ready]
set_input_delay -clock clk  -min 0  [get_ports GLB_opsum_ready]
set_output_delay -clock clk  -max 0.185  [get_ports GON_opsum_issue_fire]
set_output_delay -clock clk  -min 0  [get_ports GON_opsum_issue_fire]
set_output_delay -clock clk  -max 0.185  [get_ports GLB_ifmap_ready]
set_output_delay -clock clk  -min 0  [get_ports GLB_ifmap_ready]
set_output_delay -clock clk  -max 0.185  [get_ports GLB_filter_ready]
set_output_delay -clock clk  -min 0  [get_ports GLB_filter_ready]
set_output_delay -clock clk  -max 0.185  [get_ports GLB_ipsum_ready]
set_output_delay -clock clk  -min 0  [get_ports GLB_ipsum_ready]
set_output_delay -clock clk  -max 0.185  [get_ports GLB_opsum_valid]
set_output_delay -clock clk  -min 0  [get_ports GLB_opsum_valid]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[31]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[31]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[30]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[30]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[29]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[29]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[28]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[28]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[27]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[27]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[26]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[26]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[25]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[25]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[24]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[24]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[23]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[23]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[22]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[22]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[21]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[21]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[20]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[20]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[19]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[19]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[18]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[18]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[17]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[17]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[16]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[16]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[15]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[15]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[14]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[14]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[13]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[13]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[12]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[12]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[11]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[11]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[10]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[10]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[9]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[9]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[8]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[8]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[7]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[7]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[6]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[6]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[5]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[5]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[4]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[4]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[3]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[3]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[2]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[2]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[1]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[1]}]
set_output_delay -clock clk  -max 0.185  [get_ports {GLB_data_out[0]}]
set_output_delay -clock clk  -min 0  [get_ports {GLB_data_out[0]}]
set_input_transition -max 0.05  [get_ports rst]
set_input_transition -min 0.05  [get_ports rst]
set_input_transition -max 0.05  [get_ports set_XID]
set_input_transition -min 0.05  [get_ports set_XID]
set_input_transition -max 0.05  [get_ports {ifmap_XID_scan_in[3]}]
set_input_transition -min 0.05  [get_ports {ifmap_XID_scan_in[3]}]
set_input_transition -max 0.05  [get_ports {ifmap_XID_scan_in[2]}]
set_input_transition -min 0.05  [get_ports {ifmap_XID_scan_in[2]}]
set_input_transition -max 0.05  [get_ports {ifmap_XID_scan_in[1]}]
set_input_transition -min 0.05  [get_ports {ifmap_XID_scan_in[1]}]
set_input_transition -max 0.05  [get_ports {ifmap_XID_scan_in[0]}]
set_input_transition -min 0.05  [get_ports {ifmap_XID_scan_in[0]}]
set_input_transition -max 0.05  [get_ports {filter_XID_scan_in[3]}]
set_input_transition -min 0.05  [get_ports {filter_XID_scan_in[3]}]
set_input_transition -max 0.05  [get_ports {filter_XID_scan_in[2]}]
set_input_transition -min 0.05  [get_ports {filter_XID_scan_in[2]}]
set_input_transition -max 0.05  [get_ports {filter_XID_scan_in[1]}]
set_input_transition -min 0.05  [get_ports {filter_XID_scan_in[1]}]
set_input_transition -max 0.05  [get_ports {filter_XID_scan_in[0]}]
set_input_transition -min 0.05  [get_ports {filter_XID_scan_in[0]}]
set_input_transition -max 0.05  [get_ports {ipsum_XID_scan_in[3]}]
set_input_transition -min 0.05  [get_ports {ipsum_XID_scan_in[3]}]
set_input_transition -max 0.05  [get_ports {ipsum_XID_scan_in[2]}]
set_input_transition -min 0.05  [get_ports {ipsum_XID_scan_in[2]}]
set_input_transition -max 0.05  [get_ports {ipsum_XID_scan_in[1]}]
set_input_transition -min 0.05  [get_ports {ipsum_XID_scan_in[1]}]
set_input_transition -max 0.05  [get_ports {ipsum_XID_scan_in[0]}]
set_input_transition -min 0.05  [get_ports {ipsum_XID_scan_in[0]}]
set_input_transition -max 0.05  [get_ports {opsum_XID_scan_in[3]}]
set_input_transition -min 0.05  [get_ports {opsum_XID_scan_in[3]}]
set_input_transition -max 0.05  [get_ports {opsum_XID_scan_in[2]}]
set_input_transition -min 0.05  [get_ports {opsum_XID_scan_in[2]}]
set_input_transition -max 0.05  [get_ports {opsum_XID_scan_in[1]}]
set_input_transition -min 0.05  [get_ports {opsum_XID_scan_in[1]}]
set_input_transition -max 0.05  [get_ports {opsum_XID_scan_in[0]}]
set_input_transition -min 0.05  [get_ports {opsum_XID_scan_in[0]}]
set_input_transition -max 0.05  [get_ports set_YID]
set_input_transition -min 0.05  [get_ports set_YID]
set_input_transition -max 0.05  [get_ports {ifmap_YID_scan_in[2]}]
set_input_transition -min 0.05  [get_ports {ifmap_YID_scan_in[2]}]
set_input_transition -max 0.05  [get_ports {ifmap_YID_scan_in[1]}]
set_input_transition -min 0.05  [get_ports {ifmap_YID_scan_in[1]}]
set_input_transition -max 0.05  [get_ports {ifmap_YID_scan_in[0]}]
set_input_transition -min 0.05  [get_ports {ifmap_YID_scan_in[0]}]
set_input_transition -max 0.05  [get_ports {filter_YID_scan_in[2]}]
set_input_transition -min 0.05  [get_ports {filter_YID_scan_in[2]}]
set_input_transition -max 0.05  [get_ports {filter_YID_scan_in[1]}]
set_input_transition -min 0.05  [get_ports {filter_YID_scan_in[1]}]
set_input_transition -max 0.05  [get_ports {filter_YID_scan_in[0]}]
set_input_transition -min 0.05  [get_ports {filter_YID_scan_in[0]}]
set_input_transition -max 0.05  [get_ports {ipsum_YID_scan_in[2]}]
set_input_transition -min 0.05  [get_ports {ipsum_YID_scan_in[2]}]
set_input_transition -max 0.05  [get_ports {ipsum_YID_scan_in[1]}]
set_input_transition -min 0.05  [get_ports {ipsum_YID_scan_in[1]}]
set_input_transition -max 0.05  [get_ports {ipsum_YID_scan_in[0]}]
set_input_transition -min 0.05  [get_ports {ipsum_YID_scan_in[0]}]
set_input_transition -max 0.05  [get_ports {opsum_YID_scan_in[2]}]
set_input_transition -min 0.05  [get_ports {opsum_YID_scan_in[2]}]
set_input_transition -max 0.05  [get_ports {opsum_YID_scan_in[1]}]
set_input_transition -min 0.05  [get_ports {opsum_YID_scan_in[1]}]
set_input_transition -max 0.05  [get_ports {opsum_YID_scan_in[0]}]
set_input_transition -min 0.05  [get_ports {opsum_YID_scan_in[0]}]
set_input_transition -max 0.05  [get_ports set_LN]
set_input_transition -min 0.05  [get_ports set_LN]
set_input_transition -max 0.05  [get_ports {LN_config_in[4]}]
set_input_transition -min 0.05  [get_ports {LN_config_in[4]}]
set_input_transition -max 0.05  [get_ports {LN_config_in[3]}]
set_input_transition -min 0.05  [get_ports {LN_config_in[3]}]
set_input_transition -max 0.05  [get_ports {LN_config_in[2]}]
set_input_transition -min 0.05  [get_ports {LN_config_in[2]}]
set_input_transition -max 0.05  [get_ports {LN_config_in[1]}]
set_input_transition -min 0.05  [get_ports {LN_config_in[1]}]
set_input_transition -max 0.05  [get_ports {LN_config_in[0]}]
set_input_transition -min 0.05  [get_ports {LN_config_in[0]}]
set_input_transition -max 0.05  [get_ports {PE_en[47]}]
set_input_transition -min 0.05  [get_ports {PE_en[47]}]
set_input_transition -max 0.05  [get_ports {PE_en[46]}]
set_input_transition -min 0.05  [get_ports {PE_en[46]}]
set_input_transition -max 0.05  [get_ports {PE_en[45]}]
set_input_transition -min 0.05  [get_ports {PE_en[45]}]
set_input_transition -max 0.05  [get_ports {PE_en[44]}]
set_input_transition -min 0.05  [get_ports {PE_en[44]}]
set_input_transition -max 0.05  [get_ports {PE_en[43]}]
set_input_transition -min 0.05  [get_ports {PE_en[43]}]
set_input_transition -max 0.05  [get_ports {PE_en[42]}]
set_input_transition -min 0.05  [get_ports {PE_en[42]}]
set_input_transition -max 0.05  [get_ports {PE_en[41]}]
set_input_transition -min 0.05  [get_ports {PE_en[41]}]
set_input_transition -max 0.05  [get_ports {PE_en[40]}]
set_input_transition -min 0.05  [get_ports {PE_en[40]}]
set_input_transition -max 0.05  [get_ports {PE_en[39]}]
set_input_transition -min 0.05  [get_ports {PE_en[39]}]
set_input_transition -max 0.05  [get_ports {PE_en[38]}]
set_input_transition -min 0.05  [get_ports {PE_en[38]}]
set_input_transition -max 0.05  [get_ports {PE_en[37]}]
set_input_transition -min 0.05  [get_ports {PE_en[37]}]
set_input_transition -max 0.05  [get_ports {PE_en[36]}]
set_input_transition -min 0.05  [get_ports {PE_en[36]}]
set_input_transition -max 0.05  [get_ports {PE_en[35]}]
set_input_transition -min 0.05  [get_ports {PE_en[35]}]
set_input_transition -max 0.05  [get_ports {PE_en[34]}]
set_input_transition -min 0.05  [get_ports {PE_en[34]}]
set_input_transition -max 0.05  [get_ports {PE_en[33]}]
set_input_transition -min 0.05  [get_ports {PE_en[33]}]
set_input_transition -max 0.05  [get_ports {PE_en[32]}]
set_input_transition -min 0.05  [get_ports {PE_en[32]}]
set_input_transition -max 0.05  [get_ports {PE_en[31]}]
set_input_transition -min 0.05  [get_ports {PE_en[31]}]
set_input_transition -max 0.05  [get_ports {PE_en[30]}]
set_input_transition -min 0.05  [get_ports {PE_en[30]}]
set_input_transition -max 0.05  [get_ports {PE_en[29]}]
set_input_transition -min 0.05  [get_ports {PE_en[29]}]
set_input_transition -max 0.05  [get_ports {PE_en[28]}]
set_input_transition -min 0.05  [get_ports {PE_en[28]}]
set_input_transition -max 0.05  [get_ports {PE_en[27]}]
set_input_transition -min 0.05  [get_ports {PE_en[27]}]
set_input_transition -max 0.05  [get_ports {PE_en[26]}]
set_input_transition -min 0.05  [get_ports {PE_en[26]}]
set_input_transition -max 0.05  [get_ports {PE_en[25]}]
set_input_transition -min 0.05  [get_ports {PE_en[25]}]
set_input_transition -max 0.05  [get_ports {PE_en[24]}]
set_input_transition -min 0.05  [get_ports {PE_en[24]}]
set_input_transition -max 0.05  [get_ports {PE_en[23]}]
set_input_transition -min 0.05  [get_ports {PE_en[23]}]
set_input_transition -max 0.05  [get_ports {PE_en[22]}]
set_input_transition -min 0.05  [get_ports {PE_en[22]}]
set_input_transition -max 0.05  [get_ports {PE_en[21]}]
set_input_transition -min 0.05  [get_ports {PE_en[21]}]
set_input_transition -max 0.05  [get_ports {PE_en[20]}]
set_input_transition -min 0.05  [get_ports {PE_en[20]}]
set_input_transition -max 0.05  [get_ports {PE_en[19]}]
set_input_transition -min 0.05  [get_ports {PE_en[19]}]
set_input_transition -max 0.05  [get_ports {PE_en[18]}]
set_input_transition -min 0.05  [get_ports {PE_en[18]}]
set_input_transition -max 0.05  [get_ports {PE_en[17]}]
set_input_transition -min 0.05  [get_ports {PE_en[17]}]
set_input_transition -max 0.05  [get_ports {PE_en[16]}]
set_input_transition -min 0.05  [get_ports {PE_en[16]}]
set_input_transition -max 0.05  [get_ports {PE_en[15]}]
set_input_transition -min 0.05  [get_ports {PE_en[15]}]
set_input_transition -max 0.05  [get_ports {PE_en[14]}]
set_input_transition -min 0.05  [get_ports {PE_en[14]}]
set_input_transition -max 0.05  [get_ports {PE_en[13]}]
set_input_transition -min 0.05  [get_ports {PE_en[13]}]
set_input_transition -max 0.05  [get_ports {PE_en[12]}]
set_input_transition -min 0.05  [get_ports {PE_en[12]}]
set_input_transition -max 0.05  [get_ports {PE_en[11]}]
set_input_transition -min 0.05  [get_ports {PE_en[11]}]
set_input_transition -max 0.05  [get_ports {PE_en[10]}]
set_input_transition -min 0.05  [get_ports {PE_en[10]}]
set_input_transition -max 0.05  [get_ports {PE_en[9]}]
set_input_transition -min 0.05  [get_ports {PE_en[9]}]
set_input_transition -max 0.05  [get_ports {PE_en[8]}]
set_input_transition -min 0.05  [get_ports {PE_en[8]}]
set_input_transition -max 0.05  [get_ports {PE_en[7]}]
set_input_transition -min 0.05  [get_ports {PE_en[7]}]
set_input_transition -max 0.05  [get_ports {PE_en[6]}]
set_input_transition -min 0.05  [get_ports {PE_en[6]}]
set_input_transition -max 0.05  [get_ports {PE_en[5]}]
set_input_transition -min 0.05  [get_ports {PE_en[5]}]
set_input_transition -max 0.05  [get_ports {PE_en[4]}]
set_input_transition -min 0.05  [get_ports {PE_en[4]}]
set_input_transition -max 0.05  [get_ports {PE_en[3]}]
set_input_transition -min 0.05  [get_ports {PE_en[3]}]
set_input_transition -max 0.05  [get_ports {PE_en[2]}]
set_input_transition -min 0.05  [get_ports {PE_en[2]}]
set_input_transition -max 0.05  [get_ports {PE_en[1]}]
set_input_transition -min 0.05  [get_ports {PE_en[1]}]
set_input_transition -max 0.05  [get_ports {PE_en[0]}]
set_input_transition -min 0.05  [get_ports {PE_en[0]}]
set_input_transition -max 0.05  [get_ports {PE_config[9]}]
set_input_transition -min 0.05  [get_ports {PE_config[9]}]
set_input_transition -max 0.05  [get_ports {PE_config[8]}]
set_input_transition -min 0.05  [get_ports {PE_config[8]}]
set_input_transition -max 0.05  [get_ports {PE_config[7]}]
set_input_transition -min 0.05  [get_ports {PE_config[7]}]
set_input_transition -max 0.05  [get_ports {PE_config[6]}]
set_input_transition -min 0.05  [get_ports {PE_config[6]}]
set_input_transition -max 0.05  [get_ports {PE_config[5]}]
set_input_transition -min 0.05  [get_ports {PE_config[5]}]
set_input_transition -max 0.05  [get_ports {PE_config[4]}]
set_input_transition -min 0.05  [get_ports {PE_config[4]}]
set_input_transition -max 0.05  [get_ports {PE_config[3]}]
set_input_transition -min 0.05  [get_ports {PE_config[3]}]
set_input_transition -max 0.05  [get_ports {PE_config[2]}]
set_input_transition -min 0.05  [get_ports {PE_config[2]}]
set_input_transition -max 0.05  [get_ports {PE_config[1]}]
set_input_transition -min 0.05  [get_ports {PE_config[1]}]
set_input_transition -max 0.05  [get_ports {PE_config[0]}]
set_input_transition -min 0.05  [get_ports {PE_config[0]}]
set_input_transition -max 0.05  [get_ports {ifmap_tag_X[3]}]
set_input_transition -min 0.05  [get_ports {ifmap_tag_X[3]}]
set_input_transition -max 0.05  [get_ports {ifmap_tag_X[2]}]
set_input_transition -min 0.05  [get_ports {ifmap_tag_X[2]}]
set_input_transition -max 0.05  [get_ports {ifmap_tag_X[1]}]
set_input_transition -min 0.05  [get_ports {ifmap_tag_X[1]}]
set_input_transition -max 0.05  [get_ports {ifmap_tag_X[0]}]
set_input_transition -min 0.05  [get_ports {ifmap_tag_X[0]}]
set_input_transition -max 0.05  [get_ports {ifmap_tag_Y[2]}]
set_input_transition -min 0.05  [get_ports {ifmap_tag_Y[2]}]
set_input_transition -max 0.05  [get_ports {ifmap_tag_Y[1]}]
set_input_transition -min 0.05  [get_ports {ifmap_tag_Y[1]}]
set_input_transition -max 0.05  [get_ports {ifmap_tag_Y[0]}]
set_input_transition -min 0.05  [get_ports {ifmap_tag_Y[0]}]
set_input_transition -max 0.05  [get_ports {filter_tag_X[3]}]
set_input_transition -min 0.05  [get_ports {filter_tag_X[3]}]
set_input_transition -max 0.05  [get_ports {filter_tag_X[2]}]
set_input_transition -min 0.05  [get_ports {filter_tag_X[2]}]
set_input_transition -max 0.05  [get_ports {filter_tag_X[1]}]
set_input_transition -min 0.05  [get_ports {filter_tag_X[1]}]
set_input_transition -max 0.05  [get_ports {filter_tag_X[0]}]
set_input_transition -min 0.05  [get_ports {filter_tag_X[0]}]
set_input_transition -max 0.05  [get_ports {filter_tag_Y[2]}]
set_input_transition -min 0.05  [get_ports {filter_tag_Y[2]}]
set_input_transition -max 0.05  [get_ports {filter_tag_Y[1]}]
set_input_transition -min 0.05  [get_ports {filter_tag_Y[1]}]
set_input_transition -max 0.05  [get_ports {filter_tag_Y[0]}]
set_input_transition -min 0.05  [get_ports {filter_tag_Y[0]}]
set_input_transition -max 0.05  [get_ports {ipsum_tag_X[3]}]
set_input_transition -min 0.05  [get_ports {ipsum_tag_X[3]}]
set_input_transition -max 0.05  [get_ports {ipsum_tag_X[2]}]
set_input_transition -min 0.05  [get_ports {ipsum_tag_X[2]}]
set_input_transition -max 0.05  [get_ports {ipsum_tag_X[1]}]
set_input_transition -min 0.05  [get_ports {ipsum_tag_X[1]}]
set_input_transition -max 0.05  [get_ports {ipsum_tag_X[0]}]
set_input_transition -min 0.05  [get_ports {ipsum_tag_X[0]}]
set_input_transition -max 0.05  [get_ports {ipsum_tag_Y[2]}]
set_input_transition -min 0.05  [get_ports {ipsum_tag_Y[2]}]
set_input_transition -max 0.05  [get_ports {ipsum_tag_Y[1]}]
set_input_transition -min 0.05  [get_ports {ipsum_tag_Y[1]}]
set_input_transition -max 0.05  [get_ports {ipsum_tag_Y[0]}]
set_input_transition -min 0.05  [get_ports {ipsum_tag_Y[0]}]
set_input_transition -max 0.05  [get_ports {opsum_tag_X[3]}]
set_input_transition -min 0.05  [get_ports {opsum_tag_X[3]}]
set_input_transition -max 0.05  [get_ports {opsum_tag_X[2]}]
set_input_transition -min 0.05  [get_ports {opsum_tag_X[2]}]
set_input_transition -max 0.05  [get_ports {opsum_tag_X[1]}]
set_input_transition -min 0.05  [get_ports {opsum_tag_X[1]}]
set_input_transition -max 0.05  [get_ports {opsum_tag_X[0]}]
set_input_transition -min 0.05  [get_ports {opsum_tag_X[0]}]
set_input_transition -max 0.05  [get_ports {opsum_tag_Y[2]}]
set_input_transition -min 0.05  [get_ports {opsum_tag_Y[2]}]
set_input_transition -max 0.05  [get_ports {opsum_tag_Y[1]}]
set_input_transition -min 0.05  [get_ports {opsum_tag_Y[1]}]
set_input_transition -max 0.05  [get_ports {opsum_tag_Y[0]}]
set_input_transition -min 0.05  [get_ports {opsum_tag_Y[0]}]
set_input_transition -max 0.05  [get_ports {opsum_next_tag_X[3]}]
set_input_transition -min 0.05  [get_ports {opsum_next_tag_X[3]}]
set_input_transition -max 0.05  [get_ports {opsum_next_tag_X[2]}]
set_input_transition -min 0.05  [get_ports {opsum_next_tag_X[2]}]
set_input_transition -max 0.05  [get_ports {opsum_next_tag_X[1]}]
set_input_transition -min 0.05  [get_ports {opsum_next_tag_X[1]}]
set_input_transition -max 0.05  [get_ports {opsum_next_tag_X[0]}]
set_input_transition -min 0.05  [get_ports {opsum_next_tag_X[0]}]
set_input_transition -max 0.05  [get_ports {opsum_next_tag_Y[2]}]
set_input_transition -min 0.05  [get_ports {opsum_next_tag_Y[2]}]
set_input_transition -max 0.05  [get_ports {opsum_next_tag_Y[1]}]
set_input_transition -min 0.05  [get_ports {opsum_next_tag_Y[1]}]
set_input_transition -max 0.05  [get_ports {opsum_next_tag_Y[0]}]
set_input_transition -min 0.05  [get_ports {opsum_next_tag_Y[0]}]
set_input_transition -max 0.05  [get_ports opsum_next_tag_valid]
set_input_transition -min 0.05  [get_ports opsum_next_tag_valid]
set_input_transition -max 0.05  [get_ports GON_opsum_issue_valid]
set_input_transition -min 0.05  [get_ports GON_opsum_issue_valid]
set_input_transition -max 0.05  [get_ports GON_opsum_issue_ready]
set_input_transition -min 0.05  [get_ports GON_opsum_issue_ready]
set_input_transition -max 0.05  [get_ports GLB_ifmap_valid]
set_input_transition -min 0.05  [get_ports GLB_ifmap_valid]
set_input_transition -max 0.05  [get_ports GLB_filter_valid]
set_input_transition -min 0.05  [get_ports GLB_filter_valid]
set_input_transition -max 0.05  [get_ports GLB_ipsum_valid]
set_input_transition -min 0.05  [get_ports GLB_ipsum_valid]
set_input_transition -max 0.05  [get_ports {GLB_data_in[31]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[31]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[30]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[30]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[29]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[29]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[28]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[28]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[27]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[27]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[26]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[26]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[25]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[25]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[24]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[24]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[23]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[23]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[22]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[22]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[21]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[21]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[20]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[20]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[19]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[19]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[18]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[18]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[17]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[17]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[16]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[16]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[15]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[15]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[14]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[14]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[13]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[13]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[12]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[12]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[11]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[11]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[10]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[10]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[9]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[9]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[8]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[8]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[7]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[7]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[6]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[6]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[5]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[5]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[4]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[4]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[3]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[3]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[2]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[2]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[1]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[1]}]
set_input_transition -max 0.05  [get_ports {GLB_data_in[0]}]
set_input_transition -min 0.05  [get_ports {GLB_data_in[0]}]
set_input_transition -max 0.05  [get_ports GLB_opsum_ready]
set_input_transition -min 0.05  [get_ports GLB_opsum_ready]
set_false_path   -from [get_ports rst]
