###################################################################

# Created by write_sdc on Thu Jun 11 01:46:07 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max ss0p72v125c -max_library                         \
N16ADFP_StdCellss0p72v125c\
                         -min ff0p88vm40c -min_library                         \
N16ADFP_StdCellff0p88vm40c
set_wire_load_model -name ZeroWireload -library N16ADFP_StdCellss0p72v125c
set_max_area 0
set_load -pin_load 0.05 [get_ports {opsum[31]}]
set_load -pin_load 0.05 [get_ports {opsum[30]}]
set_load -pin_load 0.05 [get_ports {opsum[29]}]
set_load -pin_load 0.05 [get_ports {opsum[28]}]
set_load -pin_load 0.05 [get_ports {opsum[27]}]
set_load -pin_load 0.05 [get_ports {opsum[26]}]
set_load -pin_load 0.05 [get_ports {opsum[25]}]
set_load -pin_load 0.05 [get_ports {opsum[24]}]
set_load -pin_load 0.05 [get_ports {opsum[23]}]
set_load -pin_load 0.05 [get_ports {opsum[22]}]
set_load -pin_load 0.05 [get_ports {opsum[21]}]
set_load -pin_load 0.05 [get_ports {opsum[20]}]
set_load -pin_load 0.05 [get_ports {opsum[19]}]
set_load -pin_load 0.05 [get_ports {opsum[18]}]
set_load -pin_load 0.05 [get_ports {opsum[17]}]
set_load -pin_load 0.05 [get_ports {opsum[16]}]
set_load -pin_load 0.05 [get_ports {opsum[15]}]
set_load -pin_load 0.05 [get_ports {opsum[14]}]
set_load -pin_load 0.05 [get_ports {opsum[13]}]
set_load -pin_load 0.05 [get_ports {opsum[12]}]
set_load -pin_load 0.05 [get_ports {opsum[11]}]
set_load -pin_load 0.05 [get_ports {opsum[10]}]
set_load -pin_load 0.05 [get_ports {opsum[9]}]
set_load -pin_load 0.05 [get_ports {opsum[8]}]
set_load -pin_load 0.05 [get_ports {opsum[7]}]
set_load -pin_load 0.05 [get_ports {opsum[6]}]
set_load -pin_load 0.05 [get_ports {opsum[5]}]
set_load -pin_load 0.05 [get_ports {opsum[4]}]
set_load -pin_load 0.05 [get_ports {opsum[3]}]
set_load -pin_load 0.05 [get_ports {opsum[2]}]
set_load -pin_load 0.05 [get_ports {opsum[1]}]
set_load -pin_load 0.05 [get_ports {opsum[0]}]
set_load -pin_load 0.05 [get_ports ifmap_ready]
set_load -pin_load 0.05 [get_ports filter_ready]
set_load -pin_load 0.05 [get_ports ipsum_ready]
set_load -pin_load 0.05 [get_ports opsum_valid]
set_max_capacitance 0.1 [get_ports clk]
set_max_capacitance 0.1 [get_ports rst]
set_max_capacitance 0.1 [get_ports PE_en]
set_max_capacitance 0.1 [get_ports {i_config[9]}]
set_max_capacitance 0.1 [get_ports {i_config[8]}]
set_max_capacitance 0.1 [get_ports {i_config[7]}]
set_max_capacitance 0.1 [get_ports {i_config[6]}]
set_max_capacitance 0.1 [get_ports {i_config[5]}]
set_max_capacitance 0.1 [get_ports {i_config[4]}]
set_max_capacitance 0.1 [get_ports {i_config[3]}]
set_max_capacitance 0.1 [get_ports {i_config[2]}]
set_max_capacitance 0.1 [get_ports {i_config[1]}]
set_max_capacitance 0.1 [get_ports {i_config[0]}]
set_max_capacitance 0.1 [get_ports {ifmap[31]}]
set_max_capacitance 0.1 [get_ports {ifmap[30]}]
set_max_capacitance 0.1 [get_ports {ifmap[29]}]
set_max_capacitance 0.1 [get_ports {ifmap[28]}]
set_max_capacitance 0.1 [get_ports {ifmap[27]}]
set_max_capacitance 0.1 [get_ports {ifmap[26]}]
set_max_capacitance 0.1 [get_ports {ifmap[25]}]
set_max_capacitance 0.1 [get_ports {ifmap[24]}]
set_max_capacitance 0.1 [get_ports {ifmap[23]}]
set_max_capacitance 0.1 [get_ports {ifmap[22]}]
set_max_capacitance 0.1 [get_ports {ifmap[21]}]
set_max_capacitance 0.1 [get_ports {ifmap[20]}]
set_max_capacitance 0.1 [get_ports {ifmap[19]}]
set_max_capacitance 0.1 [get_ports {ifmap[18]}]
set_max_capacitance 0.1 [get_ports {ifmap[17]}]
set_max_capacitance 0.1 [get_ports {ifmap[16]}]
set_max_capacitance 0.1 [get_ports {ifmap[15]}]
set_max_capacitance 0.1 [get_ports {ifmap[14]}]
set_max_capacitance 0.1 [get_ports {ifmap[13]}]
set_max_capacitance 0.1 [get_ports {ifmap[12]}]
set_max_capacitance 0.1 [get_ports {ifmap[11]}]
set_max_capacitance 0.1 [get_ports {ifmap[10]}]
set_max_capacitance 0.1 [get_ports {ifmap[9]}]
set_max_capacitance 0.1 [get_ports {ifmap[8]}]
set_max_capacitance 0.1 [get_ports {ifmap[7]}]
set_max_capacitance 0.1 [get_ports {ifmap[6]}]
set_max_capacitance 0.1 [get_ports {ifmap[5]}]
set_max_capacitance 0.1 [get_ports {ifmap[4]}]
set_max_capacitance 0.1 [get_ports {ifmap[3]}]
set_max_capacitance 0.1 [get_ports {ifmap[2]}]
set_max_capacitance 0.1 [get_ports {ifmap[1]}]
set_max_capacitance 0.1 [get_ports {ifmap[0]}]
set_max_capacitance 0.1 [get_ports {filter[31]}]
set_max_capacitance 0.1 [get_ports {filter[30]}]
set_max_capacitance 0.1 [get_ports {filter[29]}]
set_max_capacitance 0.1 [get_ports {filter[28]}]
set_max_capacitance 0.1 [get_ports {filter[27]}]
set_max_capacitance 0.1 [get_ports {filter[26]}]
set_max_capacitance 0.1 [get_ports {filter[25]}]
set_max_capacitance 0.1 [get_ports {filter[24]}]
set_max_capacitance 0.1 [get_ports {filter[23]}]
set_max_capacitance 0.1 [get_ports {filter[22]}]
set_max_capacitance 0.1 [get_ports {filter[21]}]
set_max_capacitance 0.1 [get_ports {filter[20]}]
set_max_capacitance 0.1 [get_ports {filter[19]}]
set_max_capacitance 0.1 [get_ports {filter[18]}]
set_max_capacitance 0.1 [get_ports {filter[17]}]
set_max_capacitance 0.1 [get_ports {filter[16]}]
set_max_capacitance 0.1 [get_ports {filter[15]}]
set_max_capacitance 0.1 [get_ports {filter[14]}]
set_max_capacitance 0.1 [get_ports {filter[13]}]
set_max_capacitance 0.1 [get_ports {filter[12]}]
set_max_capacitance 0.1 [get_ports {filter[11]}]
set_max_capacitance 0.1 [get_ports {filter[10]}]
set_max_capacitance 0.1 [get_ports {filter[9]}]
set_max_capacitance 0.1 [get_ports {filter[8]}]
set_max_capacitance 0.1 [get_ports {filter[7]}]
set_max_capacitance 0.1 [get_ports {filter[6]}]
set_max_capacitance 0.1 [get_ports {filter[5]}]
set_max_capacitance 0.1 [get_ports {filter[4]}]
set_max_capacitance 0.1 [get_ports {filter[3]}]
set_max_capacitance 0.1 [get_ports {filter[2]}]
set_max_capacitance 0.1 [get_ports {filter[1]}]
set_max_capacitance 0.1 [get_ports {filter[0]}]
set_max_capacitance 0.1 [get_ports {ipsum[31]}]
set_max_capacitance 0.1 [get_ports {ipsum[30]}]
set_max_capacitance 0.1 [get_ports {ipsum[29]}]
set_max_capacitance 0.1 [get_ports {ipsum[28]}]
set_max_capacitance 0.1 [get_ports {ipsum[27]}]
set_max_capacitance 0.1 [get_ports {ipsum[26]}]
set_max_capacitance 0.1 [get_ports {ipsum[25]}]
set_max_capacitance 0.1 [get_ports {ipsum[24]}]
set_max_capacitance 0.1 [get_ports {ipsum[23]}]
set_max_capacitance 0.1 [get_ports {ipsum[22]}]
set_max_capacitance 0.1 [get_ports {ipsum[21]}]
set_max_capacitance 0.1 [get_ports {ipsum[20]}]
set_max_capacitance 0.1 [get_ports {ipsum[19]}]
set_max_capacitance 0.1 [get_ports {ipsum[18]}]
set_max_capacitance 0.1 [get_ports {ipsum[17]}]
set_max_capacitance 0.1 [get_ports {ipsum[16]}]
set_max_capacitance 0.1 [get_ports {ipsum[15]}]
set_max_capacitance 0.1 [get_ports {ipsum[14]}]
set_max_capacitance 0.1 [get_ports {ipsum[13]}]
set_max_capacitance 0.1 [get_ports {ipsum[12]}]
set_max_capacitance 0.1 [get_ports {ipsum[11]}]
set_max_capacitance 0.1 [get_ports {ipsum[10]}]
set_max_capacitance 0.1 [get_ports {ipsum[9]}]
set_max_capacitance 0.1 [get_ports {ipsum[8]}]
set_max_capacitance 0.1 [get_ports {ipsum[7]}]
set_max_capacitance 0.1 [get_ports {ipsum[6]}]
set_max_capacitance 0.1 [get_ports {ipsum[5]}]
set_max_capacitance 0.1 [get_ports {ipsum[4]}]
set_max_capacitance 0.1 [get_ports {ipsum[3]}]
set_max_capacitance 0.1 [get_ports {ipsum[2]}]
set_max_capacitance 0.1 [get_ports {ipsum[1]}]
set_max_capacitance 0.1 [get_ports {ipsum[0]}]
set_max_capacitance 0.1 [get_ports ifmap_valid]
set_max_capacitance 0.1 [get_ports filter_valid]
set_max_capacitance 0.1 [get_ports ipsum_valid]
set_max_capacitance 0.1 [get_ports opsum_ready]
set_max_fanout 10 [get_ports clk]
set_max_fanout 10 [get_ports rst]
set_max_fanout 10 [get_ports PE_en]
set_max_fanout 10 [get_ports {i_config[9]}]
set_max_fanout 10 [get_ports {i_config[8]}]
set_max_fanout 10 [get_ports {i_config[7]}]
set_max_fanout 10 [get_ports {i_config[6]}]
set_max_fanout 10 [get_ports {i_config[5]}]
set_max_fanout 10 [get_ports {i_config[4]}]
set_max_fanout 10 [get_ports {i_config[3]}]
set_max_fanout 10 [get_ports {i_config[2]}]
set_max_fanout 10 [get_ports {i_config[1]}]
set_max_fanout 10 [get_ports {i_config[0]}]
set_max_fanout 10 [get_ports {ifmap[31]}]
set_max_fanout 10 [get_ports {ifmap[30]}]
set_max_fanout 10 [get_ports {ifmap[29]}]
set_max_fanout 10 [get_ports {ifmap[28]}]
set_max_fanout 10 [get_ports {ifmap[27]}]
set_max_fanout 10 [get_ports {ifmap[26]}]
set_max_fanout 10 [get_ports {ifmap[25]}]
set_max_fanout 10 [get_ports {ifmap[24]}]
set_max_fanout 10 [get_ports {ifmap[23]}]
set_max_fanout 10 [get_ports {ifmap[22]}]
set_max_fanout 10 [get_ports {ifmap[21]}]
set_max_fanout 10 [get_ports {ifmap[20]}]
set_max_fanout 10 [get_ports {ifmap[19]}]
set_max_fanout 10 [get_ports {ifmap[18]}]
set_max_fanout 10 [get_ports {ifmap[17]}]
set_max_fanout 10 [get_ports {ifmap[16]}]
set_max_fanout 10 [get_ports {ifmap[15]}]
set_max_fanout 10 [get_ports {ifmap[14]}]
set_max_fanout 10 [get_ports {ifmap[13]}]
set_max_fanout 10 [get_ports {ifmap[12]}]
set_max_fanout 10 [get_ports {ifmap[11]}]
set_max_fanout 10 [get_ports {ifmap[10]}]
set_max_fanout 10 [get_ports {ifmap[9]}]
set_max_fanout 10 [get_ports {ifmap[8]}]
set_max_fanout 10 [get_ports {ifmap[7]}]
set_max_fanout 10 [get_ports {ifmap[6]}]
set_max_fanout 10 [get_ports {ifmap[5]}]
set_max_fanout 10 [get_ports {ifmap[4]}]
set_max_fanout 10 [get_ports {ifmap[3]}]
set_max_fanout 10 [get_ports {ifmap[2]}]
set_max_fanout 10 [get_ports {ifmap[1]}]
set_max_fanout 10 [get_ports {ifmap[0]}]
set_max_fanout 10 [get_ports {filter[31]}]
set_max_fanout 10 [get_ports {filter[30]}]
set_max_fanout 10 [get_ports {filter[29]}]
set_max_fanout 10 [get_ports {filter[28]}]
set_max_fanout 10 [get_ports {filter[27]}]
set_max_fanout 10 [get_ports {filter[26]}]
set_max_fanout 10 [get_ports {filter[25]}]
set_max_fanout 10 [get_ports {filter[24]}]
set_max_fanout 10 [get_ports {filter[23]}]
set_max_fanout 10 [get_ports {filter[22]}]
set_max_fanout 10 [get_ports {filter[21]}]
set_max_fanout 10 [get_ports {filter[20]}]
set_max_fanout 10 [get_ports {filter[19]}]
set_max_fanout 10 [get_ports {filter[18]}]
set_max_fanout 10 [get_ports {filter[17]}]
set_max_fanout 10 [get_ports {filter[16]}]
set_max_fanout 10 [get_ports {filter[15]}]
set_max_fanout 10 [get_ports {filter[14]}]
set_max_fanout 10 [get_ports {filter[13]}]
set_max_fanout 10 [get_ports {filter[12]}]
set_max_fanout 10 [get_ports {filter[11]}]
set_max_fanout 10 [get_ports {filter[10]}]
set_max_fanout 10 [get_ports {filter[9]}]
set_max_fanout 10 [get_ports {filter[8]}]
set_max_fanout 10 [get_ports {filter[7]}]
set_max_fanout 10 [get_ports {filter[6]}]
set_max_fanout 10 [get_ports {filter[5]}]
set_max_fanout 10 [get_ports {filter[4]}]
set_max_fanout 10 [get_ports {filter[3]}]
set_max_fanout 10 [get_ports {filter[2]}]
set_max_fanout 10 [get_ports {filter[1]}]
set_max_fanout 10 [get_ports {filter[0]}]
set_max_fanout 10 [get_ports {ipsum[31]}]
set_max_fanout 10 [get_ports {ipsum[30]}]
set_max_fanout 10 [get_ports {ipsum[29]}]
set_max_fanout 10 [get_ports {ipsum[28]}]
set_max_fanout 10 [get_ports {ipsum[27]}]
set_max_fanout 10 [get_ports {ipsum[26]}]
set_max_fanout 10 [get_ports {ipsum[25]}]
set_max_fanout 10 [get_ports {ipsum[24]}]
set_max_fanout 10 [get_ports {ipsum[23]}]
set_max_fanout 10 [get_ports {ipsum[22]}]
set_max_fanout 10 [get_ports {ipsum[21]}]
set_max_fanout 10 [get_ports {ipsum[20]}]
set_max_fanout 10 [get_ports {ipsum[19]}]
set_max_fanout 10 [get_ports {ipsum[18]}]
set_max_fanout 10 [get_ports {ipsum[17]}]
set_max_fanout 10 [get_ports {ipsum[16]}]
set_max_fanout 10 [get_ports {ipsum[15]}]
set_max_fanout 10 [get_ports {ipsum[14]}]
set_max_fanout 10 [get_ports {ipsum[13]}]
set_max_fanout 10 [get_ports {ipsum[12]}]
set_max_fanout 10 [get_ports {ipsum[11]}]
set_max_fanout 10 [get_ports {ipsum[10]}]
set_max_fanout 10 [get_ports {ipsum[9]}]
set_max_fanout 10 [get_ports {ipsum[8]}]
set_max_fanout 10 [get_ports {ipsum[7]}]
set_max_fanout 10 [get_ports {ipsum[6]}]
set_max_fanout 10 [get_ports {ipsum[5]}]
set_max_fanout 10 [get_ports {ipsum[4]}]
set_max_fanout 10 [get_ports {ipsum[3]}]
set_max_fanout 10 [get_ports {ipsum[2]}]
set_max_fanout 10 [get_ports {ipsum[1]}]
set_max_fanout 10 [get_ports {ipsum[0]}]
set_max_fanout 10 [get_ports ifmap_valid]
set_max_fanout 10 [get_ports filter_valid]
set_max_fanout 10 [get_ports ipsum_valid]
set_max_fanout 10 [get_ports opsum_ready]
set_max_transition 0.5 [get_ports clk]
set_max_transition 0.5 [get_ports rst]
set_max_transition 0.5 [get_ports PE_en]
set_max_transition 0.5 [get_ports {i_config[9]}]
set_max_transition 0.5 [get_ports {i_config[8]}]
set_max_transition 0.5 [get_ports {i_config[7]}]
set_max_transition 0.5 [get_ports {i_config[6]}]
set_max_transition 0.5 [get_ports {i_config[5]}]
set_max_transition 0.5 [get_ports {i_config[4]}]
set_max_transition 0.5 [get_ports {i_config[3]}]
set_max_transition 0.5 [get_ports {i_config[2]}]
set_max_transition 0.5 [get_ports {i_config[1]}]
set_max_transition 0.5 [get_ports {i_config[0]}]
set_max_transition 0.5 [get_ports {ifmap[31]}]
set_max_transition 0.5 [get_ports {ifmap[30]}]
set_max_transition 0.5 [get_ports {ifmap[29]}]
set_max_transition 0.5 [get_ports {ifmap[28]}]
set_max_transition 0.5 [get_ports {ifmap[27]}]
set_max_transition 0.5 [get_ports {ifmap[26]}]
set_max_transition 0.5 [get_ports {ifmap[25]}]
set_max_transition 0.5 [get_ports {ifmap[24]}]
set_max_transition 0.5 [get_ports {ifmap[23]}]
set_max_transition 0.5 [get_ports {ifmap[22]}]
set_max_transition 0.5 [get_ports {ifmap[21]}]
set_max_transition 0.5 [get_ports {ifmap[20]}]
set_max_transition 0.5 [get_ports {ifmap[19]}]
set_max_transition 0.5 [get_ports {ifmap[18]}]
set_max_transition 0.5 [get_ports {ifmap[17]}]
set_max_transition 0.5 [get_ports {ifmap[16]}]
set_max_transition 0.5 [get_ports {ifmap[15]}]
set_max_transition 0.5 [get_ports {ifmap[14]}]
set_max_transition 0.5 [get_ports {ifmap[13]}]
set_max_transition 0.5 [get_ports {ifmap[12]}]
set_max_transition 0.5 [get_ports {ifmap[11]}]
set_max_transition 0.5 [get_ports {ifmap[10]}]
set_max_transition 0.5 [get_ports {ifmap[9]}]
set_max_transition 0.5 [get_ports {ifmap[8]}]
set_max_transition 0.5 [get_ports {ifmap[7]}]
set_max_transition 0.5 [get_ports {ifmap[6]}]
set_max_transition 0.5 [get_ports {ifmap[5]}]
set_max_transition 0.5 [get_ports {ifmap[4]}]
set_max_transition 0.5 [get_ports {ifmap[3]}]
set_max_transition 0.5 [get_ports {ifmap[2]}]
set_max_transition 0.5 [get_ports {ifmap[1]}]
set_max_transition 0.5 [get_ports {ifmap[0]}]
set_max_transition 0.5 [get_ports {filter[31]}]
set_max_transition 0.5 [get_ports {filter[30]}]
set_max_transition 0.5 [get_ports {filter[29]}]
set_max_transition 0.5 [get_ports {filter[28]}]
set_max_transition 0.5 [get_ports {filter[27]}]
set_max_transition 0.5 [get_ports {filter[26]}]
set_max_transition 0.5 [get_ports {filter[25]}]
set_max_transition 0.5 [get_ports {filter[24]}]
set_max_transition 0.5 [get_ports {filter[23]}]
set_max_transition 0.5 [get_ports {filter[22]}]
set_max_transition 0.5 [get_ports {filter[21]}]
set_max_transition 0.5 [get_ports {filter[20]}]
set_max_transition 0.5 [get_ports {filter[19]}]
set_max_transition 0.5 [get_ports {filter[18]}]
set_max_transition 0.5 [get_ports {filter[17]}]
set_max_transition 0.5 [get_ports {filter[16]}]
set_max_transition 0.5 [get_ports {filter[15]}]
set_max_transition 0.5 [get_ports {filter[14]}]
set_max_transition 0.5 [get_ports {filter[13]}]
set_max_transition 0.5 [get_ports {filter[12]}]
set_max_transition 0.5 [get_ports {filter[11]}]
set_max_transition 0.5 [get_ports {filter[10]}]
set_max_transition 0.5 [get_ports {filter[9]}]
set_max_transition 0.5 [get_ports {filter[8]}]
set_max_transition 0.5 [get_ports {filter[7]}]
set_max_transition 0.5 [get_ports {filter[6]}]
set_max_transition 0.5 [get_ports {filter[5]}]
set_max_transition 0.5 [get_ports {filter[4]}]
set_max_transition 0.5 [get_ports {filter[3]}]
set_max_transition 0.5 [get_ports {filter[2]}]
set_max_transition 0.5 [get_ports {filter[1]}]
set_max_transition 0.5 [get_ports {filter[0]}]
set_max_transition 0.5 [get_ports {ipsum[31]}]
set_max_transition 0.5 [get_ports {ipsum[30]}]
set_max_transition 0.5 [get_ports {ipsum[29]}]
set_max_transition 0.5 [get_ports {ipsum[28]}]
set_max_transition 0.5 [get_ports {ipsum[27]}]
set_max_transition 0.5 [get_ports {ipsum[26]}]
set_max_transition 0.5 [get_ports {ipsum[25]}]
set_max_transition 0.5 [get_ports {ipsum[24]}]
set_max_transition 0.5 [get_ports {ipsum[23]}]
set_max_transition 0.5 [get_ports {ipsum[22]}]
set_max_transition 0.5 [get_ports {ipsum[21]}]
set_max_transition 0.5 [get_ports {ipsum[20]}]
set_max_transition 0.5 [get_ports {ipsum[19]}]
set_max_transition 0.5 [get_ports {ipsum[18]}]
set_max_transition 0.5 [get_ports {ipsum[17]}]
set_max_transition 0.5 [get_ports {ipsum[16]}]
set_max_transition 0.5 [get_ports {ipsum[15]}]
set_max_transition 0.5 [get_ports {ipsum[14]}]
set_max_transition 0.5 [get_ports {ipsum[13]}]
set_max_transition 0.5 [get_ports {ipsum[12]}]
set_max_transition 0.5 [get_ports {ipsum[11]}]
set_max_transition 0.5 [get_ports {ipsum[10]}]
set_max_transition 0.5 [get_ports {ipsum[9]}]
set_max_transition 0.5 [get_ports {ipsum[8]}]
set_max_transition 0.5 [get_ports {ipsum[7]}]
set_max_transition 0.5 [get_ports {ipsum[6]}]
set_max_transition 0.5 [get_ports {ipsum[5]}]
set_max_transition 0.5 [get_ports {ipsum[4]}]
set_max_transition 0.5 [get_ports {ipsum[3]}]
set_max_transition 0.5 [get_ports {ipsum[2]}]
set_max_transition 0.5 [get_ports {ipsum[1]}]
set_max_transition 0.5 [get_ports {ipsum[0]}]
set_max_transition 0.5 [get_ports ifmap_valid]
set_max_transition 0.5 [get_ports filter_valid]
set_max_transition 0.5 [get_ports ipsum_valid]
set_max_transition 0.5 [get_ports opsum_ready]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 2  -waveform {0 1}
set_clock_latency 0.12  [get_clocks clk]
set_clock_latency -source 0.13  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.05 [get_clocks clk]
set_clock_transition -min -fall 0.05 [get_clocks clk]
set_clock_transition -min -rise 0.05 [get_clocks clk]
set_clock_transition -max -fall 0.05 [get_clocks clk]
set_input_delay -clock clk  -max 1.2  [get_ports rst]
set_input_delay -clock clk  -min 0  [get_ports rst]
set_input_delay -clock clk  -max 1.2  [get_ports PE_en]
set_input_delay -clock clk  -min 0  [get_ports PE_en]
set_input_delay -clock clk  -max 1.2  [get_ports {i_config[9]}]
set_input_delay -clock clk  -min 0  [get_ports {i_config[9]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_config[8]}]
set_input_delay -clock clk  -min 0  [get_ports {i_config[8]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_config[7]}]
set_input_delay -clock clk  -min 0  [get_ports {i_config[7]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_config[6]}]
set_input_delay -clock clk  -min 0  [get_ports {i_config[6]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_config[5]}]
set_input_delay -clock clk  -min 0  [get_ports {i_config[5]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_config[4]}]
set_input_delay -clock clk  -min 0  [get_ports {i_config[4]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_config[3]}]
set_input_delay -clock clk  -min 0  [get_ports {i_config[3]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_config[2]}]
set_input_delay -clock clk  -min 0  [get_ports {i_config[2]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_config[1]}]
set_input_delay -clock clk  -min 0  [get_ports {i_config[1]}]
set_input_delay -clock clk  -max 1.2  [get_ports {i_config[0]}]
set_input_delay -clock clk  -min 0  [get_ports {i_config[0]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[31]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[31]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[30]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[30]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[29]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[29]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[28]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[28]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[27]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[27]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[26]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[26]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[25]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[25]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[24]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[24]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[23]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[23]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[22]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[22]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[21]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[21]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[20]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[20]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[19]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[19]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[18]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[18]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[17]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[17]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[16]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[16]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[15]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[15]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[14]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[14]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[13]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[13]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[12]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[12]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[11]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[11]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[10]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[10]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[9]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[9]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[8]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[8]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[7]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[7]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[6]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[6]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[5]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[5]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[4]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[4]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[3]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[3]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[2]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[2]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[1]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[1]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ifmap[0]}]
set_input_delay -clock clk  -min 0  [get_ports {ifmap[0]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[31]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[31]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[30]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[30]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[29]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[29]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[28]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[28]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[27]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[27]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[26]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[26]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[25]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[25]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[24]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[24]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[23]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[23]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[22]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[22]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[21]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[21]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[20]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[20]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[19]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[19]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[18]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[18]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[17]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[17]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[16]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[16]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[15]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[15]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[14]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[14]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[13]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[13]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[12]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[12]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[11]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[11]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[10]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[10]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[9]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[9]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[8]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[8]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[7]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[7]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[6]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[6]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[5]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[5]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[4]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[4]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[3]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[3]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[2]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[2]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[1]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[1]}]
set_input_delay -clock clk  -max 1.2  [get_ports {filter[0]}]
set_input_delay -clock clk  -min 0  [get_ports {filter[0]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[31]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[31]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[30]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[30]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[29]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[29]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[28]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[28]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[27]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[27]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[26]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[26]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[25]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[25]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[24]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[24]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[23]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[23]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[22]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[22]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[21]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[21]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[20]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[20]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[19]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[19]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[18]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[18]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[17]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[17]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[16]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[16]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[15]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[15]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[14]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[14]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[13]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[13]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[12]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[12]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[11]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[11]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[10]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[10]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[9]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[9]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[8]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[8]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[7]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[7]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[6]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[6]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[5]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[5]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[4]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[4]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[3]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[3]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[2]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[2]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[1]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[1]}]
set_input_delay -clock clk  -max 1.2  [get_ports {ipsum[0]}]
set_input_delay -clock clk  -min 0  [get_ports {ipsum[0]}]
set_input_delay -clock clk  -max 1.2  [get_ports ifmap_valid]
set_input_delay -clock clk  -min 0  [get_ports ifmap_valid]
set_input_delay -clock clk  -max 1.2  [get_ports filter_valid]
set_input_delay -clock clk  -min 0  [get_ports filter_valid]
set_input_delay -clock clk  -max 1.2  [get_ports ipsum_valid]
set_input_delay -clock clk  -min 0  [get_ports ipsum_valid]
set_input_delay -clock clk  -max 1.2  [get_ports opsum_ready]
set_input_delay -clock clk  -min 0  [get_ports opsum_ready]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[31]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[31]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[30]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[30]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[29]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[29]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[28]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[28]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[27]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[27]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[26]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[26]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[25]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[25]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[24]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[24]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[23]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[23]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[22]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[22]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[21]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[21]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[20]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[20]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[19]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[19]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[18]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[18]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[17]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[17]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[16]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[16]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[15]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[15]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[14]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[14]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[13]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[13]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[12]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[12]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[11]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[11]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[10]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[10]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[9]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[9]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[8]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[8]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[7]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[7]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[6]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[6]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[5]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[5]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[4]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[4]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[3]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[3]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[2]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[2]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[1]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[1]}]
set_output_delay -clock clk  -max 0.2  [get_ports {opsum[0]}]
set_output_delay -clock clk  -min 0  [get_ports {opsum[0]}]
set_output_delay -clock clk  -max 0.2  [get_ports ifmap_ready]
set_output_delay -clock clk  -min 0  [get_ports ifmap_ready]
set_output_delay -clock clk  -max 0.2  [get_ports filter_ready]
set_output_delay -clock clk  -min 0  [get_ports filter_ready]
set_output_delay -clock clk  -max 0.2  [get_ports ipsum_ready]
set_output_delay -clock clk  -min 0  [get_ports ipsum_ready]
set_output_delay -clock clk  -max 0.2  [get_ports opsum_valid]
set_output_delay -clock clk  -min 0  [get_ports opsum_valid]
set_input_transition -max 0.05  [get_ports rst]
set_input_transition -min 0.05  [get_ports rst]
set_input_transition -max 0.05  [get_ports PE_en]
set_input_transition -min 0.05  [get_ports PE_en]
set_input_transition -max 0.05  [get_ports {i_config[9]}]
set_input_transition -min 0.05  [get_ports {i_config[9]}]
set_input_transition -max 0.05  [get_ports {i_config[8]}]
set_input_transition -min 0.05  [get_ports {i_config[8]}]
set_input_transition -max 0.05  [get_ports {i_config[7]}]
set_input_transition -min 0.05  [get_ports {i_config[7]}]
set_input_transition -max 0.05  [get_ports {i_config[6]}]
set_input_transition -min 0.05  [get_ports {i_config[6]}]
set_input_transition -max 0.05  [get_ports {i_config[5]}]
set_input_transition -min 0.05  [get_ports {i_config[5]}]
set_input_transition -max 0.05  [get_ports {i_config[4]}]
set_input_transition -min 0.05  [get_ports {i_config[4]}]
set_input_transition -max 0.05  [get_ports {i_config[3]}]
set_input_transition -min 0.05  [get_ports {i_config[3]}]
set_input_transition -max 0.05  [get_ports {i_config[2]}]
set_input_transition -min 0.05  [get_ports {i_config[2]}]
set_input_transition -max 0.05  [get_ports {i_config[1]}]
set_input_transition -min 0.05  [get_ports {i_config[1]}]
set_input_transition -max 0.05  [get_ports {i_config[0]}]
set_input_transition -min 0.05  [get_ports {i_config[0]}]
set_input_transition -max 0.05  [get_ports {ifmap[31]}]
set_input_transition -min 0.05  [get_ports {ifmap[31]}]
set_input_transition -max 0.05  [get_ports {ifmap[30]}]
set_input_transition -min 0.05  [get_ports {ifmap[30]}]
set_input_transition -max 0.05  [get_ports {ifmap[29]}]
set_input_transition -min 0.05  [get_ports {ifmap[29]}]
set_input_transition -max 0.05  [get_ports {ifmap[28]}]
set_input_transition -min 0.05  [get_ports {ifmap[28]}]
set_input_transition -max 0.05  [get_ports {ifmap[27]}]
set_input_transition -min 0.05  [get_ports {ifmap[27]}]
set_input_transition -max 0.05  [get_ports {ifmap[26]}]
set_input_transition -min 0.05  [get_ports {ifmap[26]}]
set_input_transition -max 0.05  [get_ports {ifmap[25]}]
set_input_transition -min 0.05  [get_ports {ifmap[25]}]
set_input_transition -max 0.05  [get_ports {ifmap[24]}]
set_input_transition -min 0.05  [get_ports {ifmap[24]}]
set_input_transition -max 0.05  [get_ports {ifmap[23]}]
set_input_transition -min 0.05  [get_ports {ifmap[23]}]
set_input_transition -max 0.05  [get_ports {ifmap[22]}]
set_input_transition -min 0.05  [get_ports {ifmap[22]}]
set_input_transition -max 0.05  [get_ports {ifmap[21]}]
set_input_transition -min 0.05  [get_ports {ifmap[21]}]
set_input_transition -max 0.05  [get_ports {ifmap[20]}]
set_input_transition -min 0.05  [get_ports {ifmap[20]}]
set_input_transition -max 0.05  [get_ports {ifmap[19]}]
set_input_transition -min 0.05  [get_ports {ifmap[19]}]
set_input_transition -max 0.05  [get_ports {ifmap[18]}]
set_input_transition -min 0.05  [get_ports {ifmap[18]}]
set_input_transition -max 0.05  [get_ports {ifmap[17]}]
set_input_transition -min 0.05  [get_ports {ifmap[17]}]
set_input_transition -max 0.05  [get_ports {ifmap[16]}]
set_input_transition -min 0.05  [get_ports {ifmap[16]}]
set_input_transition -max 0.05  [get_ports {ifmap[15]}]
set_input_transition -min 0.05  [get_ports {ifmap[15]}]
set_input_transition -max 0.05  [get_ports {ifmap[14]}]
set_input_transition -min 0.05  [get_ports {ifmap[14]}]
set_input_transition -max 0.05  [get_ports {ifmap[13]}]
set_input_transition -min 0.05  [get_ports {ifmap[13]}]
set_input_transition -max 0.05  [get_ports {ifmap[12]}]
set_input_transition -min 0.05  [get_ports {ifmap[12]}]
set_input_transition -max 0.05  [get_ports {ifmap[11]}]
set_input_transition -min 0.05  [get_ports {ifmap[11]}]
set_input_transition -max 0.05  [get_ports {ifmap[10]}]
set_input_transition -min 0.05  [get_ports {ifmap[10]}]
set_input_transition -max 0.05  [get_ports {ifmap[9]}]
set_input_transition -min 0.05  [get_ports {ifmap[9]}]
set_input_transition -max 0.05  [get_ports {ifmap[8]}]
set_input_transition -min 0.05  [get_ports {ifmap[8]}]
set_input_transition -max 0.05  [get_ports {ifmap[7]}]
set_input_transition -min 0.05  [get_ports {ifmap[7]}]
set_input_transition -max 0.05  [get_ports {ifmap[6]}]
set_input_transition -min 0.05  [get_ports {ifmap[6]}]
set_input_transition -max 0.05  [get_ports {ifmap[5]}]
set_input_transition -min 0.05  [get_ports {ifmap[5]}]
set_input_transition -max 0.05  [get_ports {ifmap[4]}]
set_input_transition -min 0.05  [get_ports {ifmap[4]}]
set_input_transition -max 0.05  [get_ports {ifmap[3]}]
set_input_transition -min 0.05  [get_ports {ifmap[3]}]
set_input_transition -max 0.05  [get_ports {ifmap[2]}]
set_input_transition -min 0.05  [get_ports {ifmap[2]}]
set_input_transition -max 0.05  [get_ports {ifmap[1]}]
set_input_transition -min 0.05  [get_ports {ifmap[1]}]
set_input_transition -max 0.05  [get_ports {ifmap[0]}]
set_input_transition -min 0.05  [get_ports {ifmap[0]}]
set_input_transition -max 0.05  [get_ports {filter[31]}]
set_input_transition -min 0.05  [get_ports {filter[31]}]
set_input_transition -max 0.05  [get_ports {filter[30]}]
set_input_transition -min 0.05  [get_ports {filter[30]}]
set_input_transition -max 0.05  [get_ports {filter[29]}]
set_input_transition -min 0.05  [get_ports {filter[29]}]
set_input_transition -max 0.05  [get_ports {filter[28]}]
set_input_transition -min 0.05  [get_ports {filter[28]}]
set_input_transition -max 0.05  [get_ports {filter[27]}]
set_input_transition -min 0.05  [get_ports {filter[27]}]
set_input_transition -max 0.05  [get_ports {filter[26]}]
set_input_transition -min 0.05  [get_ports {filter[26]}]
set_input_transition -max 0.05  [get_ports {filter[25]}]
set_input_transition -min 0.05  [get_ports {filter[25]}]
set_input_transition -max 0.05  [get_ports {filter[24]}]
set_input_transition -min 0.05  [get_ports {filter[24]}]
set_input_transition -max 0.05  [get_ports {filter[23]}]
set_input_transition -min 0.05  [get_ports {filter[23]}]
set_input_transition -max 0.05  [get_ports {filter[22]}]
set_input_transition -min 0.05  [get_ports {filter[22]}]
set_input_transition -max 0.05  [get_ports {filter[21]}]
set_input_transition -min 0.05  [get_ports {filter[21]}]
set_input_transition -max 0.05  [get_ports {filter[20]}]
set_input_transition -min 0.05  [get_ports {filter[20]}]
set_input_transition -max 0.05  [get_ports {filter[19]}]
set_input_transition -min 0.05  [get_ports {filter[19]}]
set_input_transition -max 0.05  [get_ports {filter[18]}]
set_input_transition -min 0.05  [get_ports {filter[18]}]
set_input_transition -max 0.05  [get_ports {filter[17]}]
set_input_transition -min 0.05  [get_ports {filter[17]}]
set_input_transition -max 0.05  [get_ports {filter[16]}]
set_input_transition -min 0.05  [get_ports {filter[16]}]
set_input_transition -max 0.05  [get_ports {filter[15]}]
set_input_transition -min 0.05  [get_ports {filter[15]}]
set_input_transition -max 0.05  [get_ports {filter[14]}]
set_input_transition -min 0.05  [get_ports {filter[14]}]
set_input_transition -max 0.05  [get_ports {filter[13]}]
set_input_transition -min 0.05  [get_ports {filter[13]}]
set_input_transition -max 0.05  [get_ports {filter[12]}]
set_input_transition -min 0.05  [get_ports {filter[12]}]
set_input_transition -max 0.05  [get_ports {filter[11]}]
set_input_transition -min 0.05  [get_ports {filter[11]}]
set_input_transition -max 0.05  [get_ports {filter[10]}]
set_input_transition -min 0.05  [get_ports {filter[10]}]
set_input_transition -max 0.05  [get_ports {filter[9]}]
set_input_transition -min 0.05  [get_ports {filter[9]}]
set_input_transition -max 0.05  [get_ports {filter[8]}]
set_input_transition -min 0.05  [get_ports {filter[8]}]
set_input_transition -max 0.05  [get_ports {filter[7]}]
set_input_transition -min 0.05  [get_ports {filter[7]}]
set_input_transition -max 0.05  [get_ports {filter[6]}]
set_input_transition -min 0.05  [get_ports {filter[6]}]
set_input_transition -max 0.05  [get_ports {filter[5]}]
set_input_transition -min 0.05  [get_ports {filter[5]}]
set_input_transition -max 0.05  [get_ports {filter[4]}]
set_input_transition -min 0.05  [get_ports {filter[4]}]
set_input_transition -max 0.05  [get_ports {filter[3]}]
set_input_transition -min 0.05  [get_ports {filter[3]}]
set_input_transition -max 0.05  [get_ports {filter[2]}]
set_input_transition -min 0.05  [get_ports {filter[2]}]
set_input_transition -max 0.05  [get_ports {filter[1]}]
set_input_transition -min 0.05  [get_ports {filter[1]}]
set_input_transition -max 0.05  [get_ports {filter[0]}]
set_input_transition -min 0.05  [get_ports {filter[0]}]
set_input_transition -max 0.05  [get_ports {ipsum[31]}]
set_input_transition -min 0.05  [get_ports {ipsum[31]}]
set_input_transition -max 0.05  [get_ports {ipsum[30]}]
set_input_transition -min 0.05  [get_ports {ipsum[30]}]
set_input_transition -max 0.05  [get_ports {ipsum[29]}]
set_input_transition -min 0.05  [get_ports {ipsum[29]}]
set_input_transition -max 0.05  [get_ports {ipsum[28]}]
set_input_transition -min 0.05  [get_ports {ipsum[28]}]
set_input_transition -max 0.05  [get_ports {ipsum[27]}]
set_input_transition -min 0.05  [get_ports {ipsum[27]}]
set_input_transition -max 0.05  [get_ports {ipsum[26]}]
set_input_transition -min 0.05  [get_ports {ipsum[26]}]
set_input_transition -max 0.05  [get_ports {ipsum[25]}]
set_input_transition -min 0.05  [get_ports {ipsum[25]}]
set_input_transition -max 0.05  [get_ports {ipsum[24]}]
set_input_transition -min 0.05  [get_ports {ipsum[24]}]
set_input_transition -max 0.05  [get_ports {ipsum[23]}]
set_input_transition -min 0.05  [get_ports {ipsum[23]}]
set_input_transition -max 0.05  [get_ports {ipsum[22]}]
set_input_transition -min 0.05  [get_ports {ipsum[22]}]
set_input_transition -max 0.05  [get_ports {ipsum[21]}]
set_input_transition -min 0.05  [get_ports {ipsum[21]}]
set_input_transition -max 0.05  [get_ports {ipsum[20]}]
set_input_transition -min 0.05  [get_ports {ipsum[20]}]
set_input_transition -max 0.05  [get_ports {ipsum[19]}]
set_input_transition -min 0.05  [get_ports {ipsum[19]}]
set_input_transition -max 0.05  [get_ports {ipsum[18]}]
set_input_transition -min 0.05  [get_ports {ipsum[18]}]
set_input_transition -max 0.05  [get_ports {ipsum[17]}]
set_input_transition -min 0.05  [get_ports {ipsum[17]}]
set_input_transition -max 0.05  [get_ports {ipsum[16]}]
set_input_transition -min 0.05  [get_ports {ipsum[16]}]
set_input_transition -max 0.05  [get_ports {ipsum[15]}]
set_input_transition -min 0.05  [get_ports {ipsum[15]}]
set_input_transition -max 0.05  [get_ports {ipsum[14]}]
set_input_transition -min 0.05  [get_ports {ipsum[14]}]
set_input_transition -max 0.05  [get_ports {ipsum[13]}]
set_input_transition -min 0.05  [get_ports {ipsum[13]}]
set_input_transition -max 0.05  [get_ports {ipsum[12]}]
set_input_transition -min 0.05  [get_ports {ipsum[12]}]
set_input_transition -max 0.05  [get_ports {ipsum[11]}]
set_input_transition -min 0.05  [get_ports {ipsum[11]}]
set_input_transition -max 0.05  [get_ports {ipsum[10]}]
set_input_transition -min 0.05  [get_ports {ipsum[10]}]
set_input_transition -max 0.05  [get_ports {ipsum[9]}]
set_input_transition -min 0.05  [get_ports {ipsum[9]}]
set_input_transition -max 0.05  [get_ports {ipsum[8]}]
set_input_transition -min 0.05  [get_ports {ipsum[8]}]
set_input_transition -max 0.05  [get_ports {ipsum[7]}]
set_input_transition -min 0.05  [get_ports {ipsum[7]}]
set_input_transition -max 0.05  [get_ports {ipsum[6]}]
set_input_transition -min 0.05  [get_ports {ipsum[6]}]
set_input_transition -max 0.05  [get_ports {ipsum[5]}]
set_input_transition -min 0.05  [get_ports {ipsum[5]}]
set_input_transition -max 0.05  [get_ports {ipsum[4]}]
set_input_transition -min 0.05  [get_ports {ipsum[4]}]
set_input_transition -max 0.05  [get_ports {ipsum[3]}]
set_input_transition -min 0.05  [get_ports {ipsum[3]}]
set_input_transition -max 0.05  [get_ports {ipsum[2]}]
set_input_transition -min 0.05  [get_ports {ipsum[2]}]
set_input_transition -max 0.05  [get_ports {ipsum[1]}]
set_input_transition -min 0.05  [get_ports {ipsum[1]}]
set_input_transition -max 0.05  [get_ports {ipsum[0]}]
set_input_transition -min 0.05  [get_ports {ipsum[0]}]
set_input_transition -max 0.05  [get_ports ifmap_valid]
set_input_transition -min 0.05  [get_ports ifmap_valid]
set_input_transition -max 0.05  [get_ports filter_valid]
set_input_transition -min 0.05  [get_ports filter_valid]
set_input_transition -max 0.05  [get_ports ipsum_valid]
set_input_transition -min 0.05  [get_ports ipsum_valid]
set_input_transition -max 0.05  [get_ports opsum_ready]
set_input_transition -min 0.05  [get_ports opsum_ready]
set_false_path   -from [get_ports rst]
